Repository: QuantumArt/QP
Catalog: Resources/ArticleStrings.*.resx
Languages: ru_ru

# AppendToVirtual
source: It is impossible to append article to the virtual content (Id = {0})
ru_ru: Невозможно добавить статью в виртуальный контент (Id = {0})

# ArticleNotFoundInTheContent
source: Article (Id = {0}) is not found in the content (Id = {1})
ru_ru: Статья (Id = {0}) не найдена в контенте (Id = {1})

source: Created
ru_ru: Создана

# CustomFieldsGroup
source: Fields
ru_ru: Поля

# EndDate
source: Show End Date
ru_ru: Дата окончания показа

# FieldNotFound
source: Field '{0}' is not found in the content (Id = {1})
ru_ru: Поле '{0}' не найдено в контенте (Id = {1})

source: Last Modified By
ru_ru: Изменил

source: Invisible
ru_ru: Не показывать

# MissingValue
source: Field '{0}' is required
ru_ru: Поле '{0}' является обязательным

source: Modified
ru_ru: Изменена

# NotIntegerValue
source: Field '{0}' value must be an integer
ru_ru: Значение поля '{0}' должно быть целым числом

# NotNumberValue
source: Field '{0}' value must be a number
ru_ru: Значение поля '{0}' должно быть числом

# NotUniqueValue
source: Field {0} value must be unique. Conflicting article: {1}.
ru_ru: Значение поля {0} должно быть уникальным. Конфликтующая статья: {1}.

# NotValidField
source: Field '{0}' value must be valid
ru_ru: Значение поля '{0}' должно быть корректным

# NotValidOrMissingValue
source: Field '{0}' value must be valid or missing
ru_ru: Значение поля '{0}' должно быть корректным или отсутствовать

source: Status
ru_ru: Статус

source: One Time Event
ru_ru: Разовое событие

# Recurring
source: Recurring event
ru_ru: Повторяющееся событие

source: Schedule Type
ru_ru: Тип расписания

# StartDate
source: Show Start Date
ru_ru: Дата начала показа

# StartEndDates
source: Start date should be earlier than end date
ru_ru: Дата начала показа должна быть раньше, чем дата конца

# StartRightNow
source: Start Show Right Now
ru_ru: Начать показ прямо сейчас

# TooLongValue
source: Field '{0}' exceeds maximum length: {1}
ru_ru: Поле '{0}' превышает максимальную длину: {1}

# UniqueConstraintViolation
source: Field set {0} must be unique. Conflicting article: {1}.
ru_ru: Набор полей {0} должен быть уникальным. Конфликтующая статья: {1}

# VisibilityGroup
source: Visibility
ru_ru: Видимость

# Visible
source: Always Visble
ru_ru: Показывать всегда

# WithoutEndDate
source: Without End
ru_ru: Без окончания

# WorkflowGroup
source: Publication
ru_ru: Публикация

# DelayPublication
source: Schedule New Version Publication
ru_ru: Отложить публикацию новой версии

source: Cancel Split
ru_ru: Отменить расщепление

# CancelSplitWarning
source: After updating article will disappear from live site
ru_ru: После обновления статья исчезнет с основной версии сайта

source: Publication Time
ru_ru: Время публикации

# UnsupportedConstraint
source: Create Like operation doesn't support some of the content unique constraints
ru_ru: Операция "Создать по образцу" не поддерживает некоторые из ограничений уникальности контента

# Link_AddNewArticle
source: Add new article
ru_ru: Добавить новую статью

# ArticleVersionNotFoundForArticle
source: Article version (Id = {0}) is not found for the article (Id = {1})
ru_ru: Версия (Id = {0}) не найдена для статьи (Id = {1})

# ArticleVersionNotFound
source: Article version not found (Id = {0})
ru_ru: Версия статьи не найдена (Id = {0})

# ArticleVersionSuccessfullyRestored
source: Article version (Id = {0}) of article (Id = {1}) successfully restored!
ru_ru: Версия (Id = {0}) cтатьи (Id = {1}) успешно восстановлена!

# SearchBlock_AllTextFields
source: All Text Fields
ru_ru: Все текстовые поля

# SearchBlock_AllFields
source: All Fields
ru_ru: Все поля

# SearchBlock_AddFieldSearchContainer
source: Add Field Filter
ru_ru: Добавить фильтр по полю

# SearchBlock_IsNullCheckBoxLabelText
source: Missed Value
ru_ru: Отсутствие значения

# SearchBlock_InverseCheckBoxLabelText
source: Inverse result
ru_ru: Инвертировать результат

# SearchBlock_RangeFromText
source: From
ru_ru: От

# SearchBlock_RangeToText
source: To
ru_ru: До

source: Empty Value
ru_ru: Пустое значение

# LockedByAnyoneElse
source: Article is locked by user {0}.
ru_ru: Статья заблокирована пользователем {0}.

# SearchBlock_FieldSearchBlockTitle
source: Filters
ru_ru: Фильтрация

# SearchBlock_FullTextBlockTitle
source: Full Text Search
ru_ru: Полнотекстовый поиск

# InvalidDateTimeFormat
source: Field '{0}' has invalid format.
ru_ru: Поле '{0}' имеет неправильный формат.

# DenyPastDates
source: Field '{0}' denies dates in the past.
ru_ru: В поле '{0}' не разрешены даты в прошлом.

# ParentName
source: Content
ru_ru: Контент

source: Title
ru_ru: Заголовок

source: Find
ru_ru: Найти

# CannotAddBecauseOfWorkflow
source: Cannot add new article into the content because you are not a member of workflow
ru_ru: Невозможно добавить новую статью в контент, потому что Вы не являетесь участником workflow

# CannotRemoveBecauseOfWorkflow
source: Cannot remove article from the content because you are not a member of workflow or have no enough permissions with workflow
ru_ru: Невозможно удалить статью из контента, потому что Вы не являетесь участником workflow или у вас недостаточно прав доступа по worfklow

# CannotUpdateBecauseOfWorkflow
source: Cannot update article because you are not a member of workflow
ru_ru: Невозможно обновить статью, потому что Вы не являетесь участником workflow

# CannotAddBecauseOfSecurity
source: Cannot add new article into the content because you have no enough permissions
ru_ru: Невозможно добавить новую статью в контент, потому что у Вас недостаточно прав доступа

# CannotCopyBecauseOfSecurity
source: Cannot copy article because you have no enough permissions
ru_ru: Невозможно создать копию статьи, потому что у Вас недостаточно прав доступа

# CannotRemoveBecauseOfSecurity
source: Cannot remove article from the content because you have no enough permissions
ru_ru: Невозможно удалить статью из контента, потому что у Вас недостаточно прав доступа

# CannotRemoveVersionsBecauseOfSecurity
source: Cannot remove article versions because you have no enough permissions
ru_ru: Невозможно удалить версии статьи, потому что у Вас недостаточно прав доступа

# CannotRestoreVersionBecauseOfSecurity
source: Cannot restore article version because you have no enough permissions
ru_ru: Невозможно восстановить версию статьи, потому что у Вас недостаточно прав доступа

# CannotUpdateBecauseOfSecurity
source: Cannot update article because you have no enough permissions
ru_ru: Невозможно обновить статью, потому что у Вас недостаточно прав доступа

# SomeoneBlockedByWorkflow
source: Some articles have not been processed because you are not a workflow member or have no enough permissions with workflow. Id: {0}
ru_ru: Некоторые статьи не обработаны, потому что Вы не являетесь участником workflow или у Вас недостаточно прав доступа по workflow. Id: {0}

# SomeoneLocked
source: Some articles have not been processed because they are locked by other users. Id: {0}
ru_ru: Некоторые статьи не обработаны, потому что они заблокированы другими пользователями. Id: {0}

# SomeoneNotAccessed
source: Some articles have not been processed because of insufficient permissions. Id: {0}
ru_ru: Некоторые статьи не обработаны из-за недостаточных прав доступа. Id: {0}

# SomeoneNotFound
source: Some articles have not been found. Id: {0}
ru_ru: Некоторые статьи не найдены. Id: {0}

# SomeoneRedundant
source: There is no need for processing some articles. Id: {0}
ru_ru: Нет необходимости обрабатывать некоторые статьи. Id: {0}

# SearchBlock_ByRange
source: Search By Range
ru_ru: По диапазону

# SearchBlock_ByValue
source: Search By Value
ru_ru: По значению

# SearchBlock_Value
source: Value
ru_ru: Значение

# InputMaskNotMatch
source: Field '{0}' doesn't match input mask
ru_ru: Поле '{0}' не соответствует маске ввода

# Daily
source: Days
ru_ru: Дни

# Monthly
source: Months
ru_ru: Месяцы

source: Repetition End Date
ru_ru: Дата окончания повторений

# RepetitionNoEnd
source: No End
ru_ru: Без окончания

source: Repetition Start Date
ru_ru: Дата начала повторений

# ScheduleRecurringType
source: Interval Between Repetitions (units)
ru_ru: Интервал между повторениями (единицы измерения)

# ScheduleRecurringValue
source: Interval Between Repetitions (value)
ru_ru: Интервал между повторениями (значение)

# Weekly
source: Weeks
ru_ru: Недели

# Yearly
source: Years
ru_ru: Годы

source: Friday
ru_ru: Пятница

source: Monday
ru_ru: Понедельник

source: Saturday
ru_ru: Суббота

source: Sunday
ru_ru: Воскресенье

source: Thursday
ru_ru: Четверг

source: Tuesday
ru_ru: Вторник

source: Wednesday
ru_ru: Среда

# DayOfMonth
source: Date
ru_ru: Число

source: Day of Week
ru_ru: День недели

# DaysLimitationUnit
source: Days
ru_ru: Дни

# DaySpecifyingByDate
source: Date
ru_ru: Числом

# DaySpecifyingByDayOfWeek
source: Day Of Week
ru_ru: Днем недели

# DaySpecifyingType
source: Day is specified by
ru_ru: День задается

# DurationUnit
source: Duration (units)
ru_ru: Длительность (единицы измерения)

source: Duration (value)
ru_ru: Длительность (значение)

# FirstWeek
source: First
ru_ru: Первая

# FourthWeek
source: Fourth
ru_ru: Четвертая

# HoursLimitationUnit
source: Hours
ru_ru: Часы

# LastWeek
source: Last
ru_ru: Последняя

# LimitedByDuration
source: Duration
ru_ru: Длительностью

# LimitedByTime
source: End Time
ru_ru: Временем окончания

# MinutesLimitationUnit
source: Minutes
ru_ru: Минуты

# MonthNumber
source: Month
ru_ru: Месяц

# MonthsLimitationUnit
source: Months
ru_ru: Месяцы

# RepetitionIntervalGroup
source: Repetition Interval
ru_ru: Интервал повторений

# RepetitionParamsGroup
source: Show day definition
ru_ru: Определение дней показа

# SecondWeek
source: Second
ru_ru: Вторая

source: Show End Time
ru_ru: Время окончания показа

source: Show is limited by
ru_ru: Показ ограничивается

source: Show Start Time
ru_ru: Время начала показа

# ShowTimeIntervalGroup
source: Show time Interval
ru_ru: Интервал времени показа

# ThirdWeek
source: Third
ru_ru: Третья

source: Weekday
ru_ru: Рабочие дни

source: Weekend
ru_ru: Выходные

source: Week of month
ru_ru: Неделя месяца

# WeeksLimitationUnit
source: Weeks
ru_ru: Недели

# YearsLimitationUnit
source: Years
ru_ru: Годы

# DayOfMonthError
source: Date have to be between 1 and 31
ru_ru: Дата должна лежать в деапазоне от 1 до 31

# DurationValueError
source: Value of Interval Duration have to be between 1 and 100
ru_ru: Значение длительности интервала может принимать значения от 1 до 100

# ScheduleRecurringValueError
source: Value of Interval Between Repetitions have to be between 1 and 100
ru_ru: Интервал между повторениями может принимать значения от 1 до 100

# ShowStartTimeError
source: Show Start Time have to be earlier than Show End Time
ru_ru: Время начала показа должно быть меньше времени окончания показа

# RepetitionStartDateError
source: Repetition Start Date have to be earlier than Repetition End Date
ru_ru: Дата начала повторений должна быть меньше даты окончания повторений

# ArticleNotFound
source: Article not found (Id = {0})
ru_ru: Статья не найдена (Id = {0})

# O2MRelateToCurrentArticle
source: Article cannot be self-related
ru_ru: Статья не может ссылаться сама на себя

# SearchBlock_SelectFieldToFilter
source: Select field to filter
ru_ru: Выберите поле для фильтрации

# WarningHasChildren
source: Article has {0} child articles. Continue?
ru_ru: Статья является родительской для {0} статей. Продолжить?

# WarningHasNonArchiveChildren
source: Article has {0} non-archived child articles. Continue?
ru_ru: Статья является родительской для {0} неархивных статей. Продолжить?

# WarningHasChildrenMultiple
source: Some articles (IDs: {0}) have child articles. Continue?
ru_ru: Некоторые из выбранных статей (IDs: {0}) являются родительскими для других статей. Продолжить?

# WarningHasNonArchiveChildrenMultiple
source: Some articles (IDs: {0}) have non-archived child articles. Continue?
ru_ru: Некоторые из выбранных статей (IDs: {0}) являются родительскими для других неархивных статей. Продолжить?

# BaseRelationFieldRequired
source: Base relation field is required, so you cannot reset values
ru_ru: Базовое поле связи является обязательным, поэтому вы не можете сбрасывать значения

# BaseRelationUniqueViolation
source: Unique constrant violation for base field (Duplicates found: {0})
ru_ru: Нарушение уникальности для базового поля (Найдено дубликатов: {0})

source: Current article violates relation condition
ru_ru: Текущая статья нарушает условие на связь

# IsInvisibleTooltip
source: Invisible
ru_ru: Невидимая

# IsScheduledTooltip
source: Scheduled
ru_ru: Назначено расписание

# IsSplitedTooltip
source: Splitted
ru_ru: Расщеплена

# IsLockedHeaderTooltip
source: Locked
ru_ru: Заблокировано

# InvalidClassiferValue
source: The Field Value is invalid
ru_ru: Недопустимое значение поля

# OperationIsNotAllowedForAggregated
source: Operation is not allowed for aggregated article.
ru_ru: Операция недопустима для агрегированной статьи

# CannotUpdateBecauseOfRelationSecurity
source: Cannot update article because you have no enough permissions to all of the related articles
ru_ru: Невозможно обновить статью, потому что у Вас недостаточно прав доступа на все связанные статьи

# CannotAddBecauseOfRelationSecurity
source: Cannot add article because you have no enough permissions to all of the related articles
ru_ru: Невозможно добавить статью, потому что у Вас недостаточно прав доступа на все связанные статьи

# SomeoneBlockedByRelationSecurity
source: Some articles have not been processed because you have no enough permissions to all of the related articles. Id: {0}
ru_ru: Некоторые статьи не обработаны, потому что у вас недостаточно прав доступа на все связанные статьи. Id: {0}

# CustomValidationFailed
source: Custom Validating process is failed: {0}
ru_ru: Ошибка при выполнении пользовательской валидации: {0}

# LeaveComment
source: Leave a comment
ru_ru: Оставить комментарий

source: Last comment
ru_ru: Последний комментарий

source: Comments
ru_ru: Комментарии

# VariationGroup
source: Variations
ru_ru: Вариации

source: Context
ru_ru: Контекст

source: Remove current variation
ru_ru: Удалить текущую вариацию

# TotalVariationsMessage
source: The number of current article variations - <span class="currentTotal"></span>
ru_ru: Для данной статьи существует вариаций - <span class="currentTotal"></span>

# SearchBlock_BySelector
source: Search By Selector
ru_ru: По селектору

# SearchBlock_ByList
source: Search By List
ru_ru: По списку

# SearchBlock_ListText
source: List
ru_ru: Список

# SearchBlock_Text
source: Text
ru_ru: Текст

# SearchBlock_FullTextBlockSearchResultLimitTitle
source: View result limit
ru_ru: Лимит отображения

source: Expand childs
ru_ru: Расширить вниз

source: Expand parents
ru_ru: Расширить вверх

source: Total selected articles
ru_ru: Всего выбрано статей

source: Unique Id
ru_ru: Уникальный идентификатор

# GuidShouldBeUnique
source: Entered guid already exists
ru_ru: Введенный уникальный идентификатор уже существует

# GuidWrongFormat
source: Wrong guid format
ru_ru: Неверный формат уникального идентификатора

# ShouldContainAllSelectedCases
source: Result must contain ALL selected cases
ru_ru: Результат должен содержать ВСЕ выбранные варианты

# CannotRemoveBecauseOfRelationSecurity
source: Cannot remove article because you have no enough permissions to all of the related articles
ru_ru: Невозможно удалить статью из контента, потому что у Вас недостаточно прав доступа для всех связанных статей

source: Archive
ru_ru: Архивная

# SearchBlock_ExactMatchBoxLabelText
source: Exact Match
ru_ru: Точное совпадение

# SearchBlock_StartBeginningCheckBoxLabelText
source: Search from beginning
ru_ru: Поиск от начала строки

# CollaborativePublication
source: Collaborative Publication with
ru_ru: Совместная публикация с

source: Forwards
ru_ru: Вперед

# Backwards
source: Backwards by workflow
ru_ru: Назад

# DirectChange
source: Change status directly
ru_ru: Сменить статус напрямую

# LeaveTheSame
source: Use the same status
ru_ru: Оставить тот же статус

# Direction
source: Use Workflow Rules
ru_ru: Применить правила Workflow

source: Current status
ru_ru: Текущий статус

source: Live-version
ru_ru: Live-версия

# ArticleRepository_GetByIdForTree_NotFound
source: Article is not found (Id = {0})
ru_ru: Статья не найдена (Id = {0})

# StatusUnknown
source: Unknown
ru_ru: Неизвестен
