Repository: QuantumArt/QP
Catalog: Resources/ContentStrings.*.resx
Languages: ru_ru

# AddContextClassNameInvalidFormat
source: Invalid additional context class name
ru_ru: Некорректное имя дополнительного контекстного класса

# AddContextClassNameLengthExceeded
source: The length of additional context class name should not exceed {5} characters
ru_ru: Длина имени дополнительного контекстного класса не должна превышать {1} символов

# AddContextClassNameNonUnique
source: Additional context class name is already in using in the site
ru_ru: Имя дополнительного контекстного класса не является уникальным на уровне сайта

# AddContextClassNameNonUniqueDB
source: Additional context class name is already in using in the database
ru_ru: Имя дополнительного контекстного класса не является уникальным на уровне базы данных

source: Additional context class name
ru_ru: Имя дополнительного контекстного класса

# AllContentGroups
source: All Groups
ru_ru: Все группы

source: Archive on Removal
ru_ru: Архивировать при удалении

# ArticlesNumberPerPage
source: Number of Articles Per Page
ru_ru: Число статей на странице

# ArticlesNumberPerPageNotInRange
source: Number of Articles Per Page is not in acceptable range: from {0} to {1}
ru_ru: Число статей на странице не входит в допустимый диапазон: от {0} до {1}

# CannotAddBecauseOfSecurity
source: Cannot add content into the site because you have no enough permissions
ru_ru: Невозможно создать новый контент в текущем сайте, потому что у Вас недостаточно прав доступа

# CannotAddGroupBecauseOfSecurity
source: Cannot add content group into the site because you have no enough permissions
ru_ru: Невозможно создать новую группу контентов в текущем сайте, потому что у Вас недостаточно прав доступа

# CannotCopyBecauseOfSecurity
source: Cannot copy content because you have no enough permissions
ru_ru: Невозможно создать копию контента, потому что у Вас недостаточно прав доступа

# CannotRemoveBecauseOfSecurity
source: Cannot remove content because you have no enough permissions
ru_ru: Невозможно удалить контент, потому что у Вас недостаточно прав доступа

# CannotUpdateBecauseOfSecurity
source: Cannot update content because you have no enough permissions
ru_ru: Невозможно обновить контент, потому что у Вас недостаточно прав доступа

source: Cannot update default group
ru_ru: Нельзя обновить группу по умолчанию

# CannotUpdateGroupBecauseOfSecurity
source: Cannot update content group because you have no enough permissions
ru_ru: Невозможно обновить группу контентов, потому что у Вас недостаточно прав доступа

# ContentNotFound
source: Content not found (Id = {0})
ru_ru: Контент не найден (Id = {0})

source: Create Versions
ru_ru: Создавать версии

source: Current Content
ru_ru: Этот контент

# DefaultContentGroup
source: Default Group
ru_ru: Группа по умолчанию

source: Description
ru_ru: Описание

# DescriptionMaxLengthExceeded
source: The length of description should not exceed {5} characters
ru_ru: Длина описания не должна превышать {1} символов

source: Enable articles permissions
ru_ru: Включить права доступа для статей

source: Enable Site Sharing
ru_ru: Разрешить доступ из других сайтов

# FriendlyPluralMaxLengthExceeded
source: The length of plural friendly name should not exceed {5} characters
ru_ru: Длина дружественного имени во множественном числе не должна превышать {1} символов

# FriendlySingularMaxLengthExceeded
source: The length of singular friendly name should not exceed {5} characters
ru_ru: Длина дружественного имени в единственном числе не должна превышать {1} символов

source: Group
ru_ru: Группа

source: Group Name
ru_ru: Название группы

# GroupNameInvalidFormat
source: Invalid content group name
ru_ru: Некорректное имя группы контентов

# GroupNameMaxLengthExceeded
source: The length of content group name should not exceed {5} characters
ru_ru: Длина имени группы контентов не должна превышать {1} символов

# GroupNameNonUnique
source: Content group name is already in using on the site
ru_ru: Имя группы контентов не является уникальным на уровне сайта

# GroupNameNotEntered
source: Please enter content group name
ru_ru: Пожалуйста, введите имя группы контентов

# GroupNotFound
source: Content group not found (Id = {0})
ru_ru: Группа контентов не найдена (Id = {0})

# IsAltUserQueryUsed
source: Use separate query for United View
ru_ru: Использовать отдельный запрос для United View

# JoinFields
source: Fields
ru_ru: Поля

# JoinFieldsNotEntered
source: Please check Fields
ru_ru: Пожалуйста укажите поля

# JoinRoot
source: Source content
ru_ru: Контент-источник

# Legend_BasicParameters
source: Basic Parameters
ru_ru: Основные параметры

# Legend_FriendlyName
source: Friendly Name
ru_ru: Дружественное имя

# Legend_LinqParameters
source: LINQ Mapping Parameters
ru_ru: Параметры отображения в LINQ-классы

# Legend_VersionControl
source: Version Control
ru_ru: Контроль версий

# Legend_VirtualContentParameters
source: Virtual Content Parameters
ru_ru: Параметры виртуального контента

# Link_AddNewContent
source: Add New Content
ru_ru: Добавить новый контент

# Link_AddNewField
source: Add New Field
ru_ru: Добавить новое поле

source: Map as class
ru_ru: Отображать как класс

source: Maximum Number of Stored Versions
ru_ru: Максимальное число хранимых версий

# Name
source: Content name
ru_ru: Имя контента

# NameInvalidFormat
source: Invalid content name
ru_ru: Некорректное имя контента

# NameMaxLengthExceeded
source: The length of content name should not exceed {5} characters
ru_ru: Длина имени контента не должна превышать {1} символов

# NameNonUnique
source: Content name is already in using on the site
ru_ru: Имя контента не является уникальным на уровне сайта

# NameNonUniqueDB
source: Content name is already in using in the database
ru_ru: Имя контента не является уникальным на уровне базы данных

# NameNotEntered
source: Please enter content name
ru_ru: Пожалуйста, введите имя контента

source: Name (plural)
ru_ru: Имя (множественное)

# NamePluralInvalidFormat
source: Invalid plural LINQ name
ru_ru: Некорректное имя LINQ-класса во множественном числе

# NamePluralMaxLengthExceeded
source: The length of plural LINQ name should not exceed {5} characters
ru_ru: Длина имени LINQ-класса во множественном числе не должна превышать {1} символов

# NamePluralNonUnique
source: Plural LINQ name is already in using on the site
ru_ru: Имя LINQ-класса во множественном числе не является уникальным на уровне сайта

# NamePluralNonUniqueDB
source: Plural LINQ name is already in using in the database
ru_ru: Имя LINQ-класса во множественном числе не является уникальным на уровне базы данных

# NamePluralNotEntered
source: Please enter plural LINQ name
ru_ru: Пожалуйста, введите имя LINQ-класса во множественном числе

source: Name (singular)
ru_ru: Имя (единственное)

# NameSingularInvalidFormat
source: Invalid singular LINQ name
ru_ru: Некорректное имя LINQ-класса в единственном числе

# NameSingularMaxLengthExceeded
source: The length of singular LINQ name should not exceed {5} characters
ru_ru: Длина имени LINQ-класса в единственном числе не должна превышать {1} символов

# NameSingularNonUnique
source: Singular LINQ name name is already in using on the site
ru_ru: Имя LINQ-класса в единственном числе не является уникальным на уровне сайта

# NameSingularNonUniqueDB
source: Singular LINQ name name is already in using in the database
ru_ru: Имя LINQ-класса в единственном числе не является уникальным на уровне базы данных

# NameSingularNotEntered
source: Please enter singular LINQ name
ru_ru: Пожалуйста, введите имя LINQ-класса в единственном числе

source: No workflow
ru_ru: Нет workflow

source: Plural
ru_ru: Множественное число

# RelatedContentsExist
source: Content could not be removed because there are following related contents: {0}
ru_ru: Контент не может быть удален, так как существуют следующие связанные с ним контенты: {0}

source: Select content
ru_ru: Выберите контент

# SelectContentGroup
source: Select Content Groups
ru_ru: Выберите группу контентов

source: Singular
ru_ru: Единственное число

# SourceContentNotEntered
source: Please enter Source content
ru_ru: Пожалуйста укажите контент-источник

source: Split Articles
ru_ru: Расщеплять статьи

# ToRebuild
source: Rebuild virtual content
ru_ru: Перестроить виртуальный контент

# UnionBaseContentNotEntered
source: Please select Source contents
ru_ru: Пожалуйста выберите контенты-источники

# UnionSourceContents
source: Source contents
ru_ru: Контенты-источники

source: Use default filtration
ru_ru: Использовать фильтрацию по умолчанию

# UserQuery
source: Query
ru_ru: Запрос

# UserQueryAlternative
source: Query for United View
ru_ru: Запрос для United View

# UserQueryAltIsInvalid
source: Query for United View is invalid: {0}
ru_ru: Ошибка в запросе для United View: {0}

# UserQueryIsInvalid
source: Query is invalid: {0}
ru_ru: Ошибка в запросе: {0}

# UserQueryNotEntered
source: Please enter Query
ru_ru: Пожалуйста введите текст запроса

# VirtualSubContentsExist
source: Content could not be removed because there are following inherited virtual contents: {0}
ru_ru: Контент не может быть удален, так как существуют следующие подчиненные виртуальные контенты: {0}

source: Virtual Type
ru_ru: Тип виртуального контента

# VirtualTypeCantBeChanged
source: Virtual Type cannot be changed, because there are some contents which were built on the current content
ru_ru: Тип виртуального контента не может быть изменен, так как существуют виртуальные контенты, основанные на данном контенте

# NotAllMandatoryColumnsInUserQuery
source: There are not all mandatory columns in query. {0} are expected.
ru_ru: Не все обязательные поля указаны в запросе. Не указаны {0}.

# UserQueryAndAltColumnsMismatch
source: Column sets and/or column types of Query and Query for United View are mismatched
ru_ru: Наборы колонок и/или типы колонок возвращаемые запросом и запросом для United View не совпадают

# InvalidColumnsInUserQuery
source: There are invalid type columns: {0}
ru_ru: Контент содержит поля имеющие недопустимые типы: {0}

# UserQueryColumnTypeChanged
source: The type of column [{0}] from the table [{1}] is casted from {2} to {3}
ru_ru: Тип столбца [{0}] таблицы [{1}] изменен с {2} на {3}

# UserQuerySameNameColumsHaveDiffTypes
source: The types of column [{0}] in the next tables {1} are mismatched
ru_ru: Типы столбца [{0}] в таблицах {1} не совпадают

# ErrorInSubContent
source: Error in the following inherited virtual contents: {0}. Error: {1}
ru_ru: Ошибка в подчиненном виртуальном контенте: {0}. Ошибка: {1}

# CyclesInContentTree
source: Cycle in the content graph has been found
ru_ru: Был найден цикл в графе контентов

source: Select Site
ru_ru: Выберите сайт

source: All Sites
ru_ru: Все сайты

# ParentSiteName
source: Site
ru_ru: Сайт

# VirualSubContentProcessingError
source: Error while processing inheritance virtual content ({0}) "{1}": {2}
ru_ru: Ошибка при обработке дочернего виртуального контента ({0}) "{1}": {2}

# ClearContentStageName
source: Clear content "{0}"
ru_ru: Очистка контента "{0}"

# RemoveContentStageName
source: Removing content "{0}"
ru_ru: Удаление контента "{0}"

# ContentsAreSharedRelated
source: Following contents could not be removed because there are related contents in other sites: {0}
ru_ru: Следующие контенты не могут быть удалены потому что в других сайтах существуют связанные с ними контенты: {0}

# ContentsAreSharedUnionBase
source: Following contents could not be removed because there are inherited virtual contents in other sites: {0}
ru_ru: Следующие контенты не могут быть удалены потому что в других сайтах существуют подчиненные виртуальные контенты: {0}

# ArticlePermissionsComplete
source: Content Article Permissions has been enabled.
ru_ru: Права доступа для статей контента включены.

# RebuildVirtualContentViewsStageName
source: Refreshing views
ru_ru: Обновление представлений

# RebuildUserQueryStageName
source: Updating USER QUERY structure
ru_ru: Обновление структуры USER QUERY

# ContentIsAggregated
source: Content could not be removed because content contains articles and the following aggregated fields: {0}
ru_ru: Контент не может быть удален, потому что он содержит статьи и следующие агрегированные поля: {0}

# CannotChangeAutoArchive
source: "Auto Archive" could not be changed because there are aggregated fields in the current content
ru_ru: Свойство "Архивировать при удалении" не может быть изменено, потому что контент содержит агрегированные поля

# CannotChangeIsAsync
source: "Is Async" could not be changed because there are aggregated fields in the current content
ru_ru: Свойство "Расщеплять статьи" не может быть изменено, потому что контент содержит агрегированные поля

# CannotChangeWorkflow
source: Workflow could not be changed because there are aggregated fields in the current content
ru_ru: Workflow не может быть изменено, потому что контент содержит агрегированные поля

# OperationIsNotAllowedForAggregated
source: Operation is not allowed for aggregated content.
ru_ru: Операция недопустима для агрегированного контента.

# OperationIsNotAllowedForAggregateds
source: Operation is not allowed for aggregated contents "{0}".
ru_ru: Операция недопустима для агрегированных контентов "{0}".

# OperationIsNotAllowedForRoot
source: Operation is not allowed for root content.
ru_ru: Операция недопустима для корневого контента.

source: Create Default XAML Validation
ru_ru: Создать валидацию XAML по умолчанию

source: Disable XAML Validation
ru_ru: Запретить валидацию XAML

source: XAML Validation
ru_ru: Валидация XAML

# Legend_CustomValidation
source: Custom Validation
ru_ru: Пользовательская валидация

source: Disable Changing Actions
ru_ru: Запретить операции редактирования

# ArticleChangingIsProhibited
source: Changing\Creation actions of this content arcticles is prohibited.
ru_ru: Создание/Изменение статей контента запрещено.

# ContentChangingIsProhibited
source: Content changing actions are disabled
ru_ru: Операции запрещена для данного контента

source: Export Articles
ru_ru: Экспорт статей

source: Import articles
ru_ru: Импорт статей

source: Hierarchy
ru_ru: Иерархия

source: Parent Content
ru_ru: Родительский контент

# SelectParentContent
source: Not selected
ru_ru: Не выбран

# UseForContext
source: Use for context switching
ru_ru: Использовать для переключения контекстов

# ErrorsOnCopyingVirtualContents
source: Errors on copying next virtual contents:
ru_ru: Ошибки при копировании следующих контентов:

# Legend_ClientScripts
source: Client scripts
ru_ru: Клиентские скрипты

# FormScript
source: Script for form
ru_ru: Скрипт для формы

source: For replication
ru_ru: Включить репликацию

# TraceImportScript
source: Trace script after CSV Import
ru_ru: Скрипт трассировки после импорта СSV
