Repository: QuantumArt/QP
Catalog: Resources/CustomActionStrings.*.resx
Languages: ru_ru

source: Action not found
ru_ru: Действие не найдено (Id = {0})

# ActionNotFoundByCode
source: Action not found (Code = {0})
ru_ru: Действие не найдено (Code = {0})

# ActionTypeNotSelected
source: Please select Action Type
ru_ru: Пожалуйста выберите тип действия

# AddNewCustomAction
source: Add New Action
ru_ru: Добавить новое пользовательское действие

# BasicParametersTitle
source: Basic Parameters
ru_ru: Основные параметры

# CannotCopyBecauseOfSecurity
source: Cannot copy custom action because you have no enough permissions
ru_ru: Невозможно создать копию пользовательского действия, потому что у Вас недостаточно прав доступа

source: Confirm Phrase
ru_ru: Фраза подтверждения

# ConfirmPhraseLengthExceeded
source: The length of Confirm Phrase should not exceed {1} characters!
ru_ru: Длина фразы подтверждения не должна превышать {5} символов!

source: Content selection mode
ru_ru: Режим выбора контентов

# CustomActionEntityType
source: Entity Type
ru_ru: Тип сущности

# CustomActionType
source: Action Type
ru_ru: Тип действия

# DefaultActionTypeOption
source: Select action type
ru_ru: Выберите тип действия

# DefaultEntityTypeOption
source: Select entity type
ru_ru: Выберите тип сущности

# EntityTypeNotSelected
source: Please select Entity Type
ru_ru: Пожалуйста, выберите тип сущности

source: Has pre-action
ru_ru: Есть предварительное действие

source: Has settings
ru_ru: Есть настройки

# HideExceptSelectedContents
source: Hide in all contents except selected
ru_ru: Скрывать во всех контентах, кроме выбранных

# HideExceptSelectedSites
source: Hide on all sites except selected
ru_ru: Скрывать на всех сайтах, кроме выбранных

source: Icon URL
ru_ru: Url иконки

# IconUrlInvalidFormat
source: Invalid Icon URL format
ru_ru: Недопустимый формат URL иконки

# IconUrlMaxLengthExceeded
source: The length of Icon URL should not exceed {1} characters!
ru_ru: Длина URL иконки не должна превышать {5} символов!

# IsInterface
source: Interface
ru_ru: Интерфейс

# IsWindow
source: Window
ru_ru: Окно

source: Order
ru_ru: Порядок

# OrderIsNotInRange
source: Values of Order value must be greater than zero
ru_ru: Значение поля "Порядок" должно быть больше нуля

# OrderValueIsNotUniq
source: The value of Order is not unique for the selected Entity Type. The valid value is {0} .
ru_ru: Порядок имеет не уникальное значение для выбранного типа сущьности. Допустимое значение равно {0}.

# SelectedContentIDs
source: Selected contents
ru_ru: Выбранные контенты

# SelectedSiteIDs
source: Selected sites
ru_ru: Выбранные сайты

# ShowExpectSelectedContents
source: Show in all contents except selected
ru_ru: Показывать во всех контентах, кроме выбранных

# ShowExpectSelectedSites
source: Show on all sites except selected
ru_ru: Показывать на всех сайтах, кроме выбранных

# ShowInMenu
source: Show in context menu
ru_ru: Показывать в контекстном меню

# ShowInToolbar
source: Show on toolbar
ru_ru: Показывать на панели инструментов

source: Site selection mode
ru_ru: Режим выбора сайтов

# SomeEntitiesNotAccessable
source: Some entities have not been processed because of insufficient permissions. IDs: {0}
ru_ru: Некоторые сущности не обработаны из-за недостаточных прав доступа. IDs: {0}

# ThereIsNoContextMenuForEntityType
source: There is no Context Menu for Entity Type '{0}'
ru_ru: Не существует контекстного меню для типа сущности '{0}'

# ToolbarButtonParentActionId
source: For Action
ru_ru: Для действия

# ToolbarButtonParentActionNotSelected
source: Please select Action
ru_ru: Пожалуйста, выберите действие

# UrlInvalidFormat
source: Invalid URL format
ru_ru: Недопустимый формат URL

# UrlMaxLengthExceeded
source: The length of URL should not exceed {1} characters!
ru_ru: Длина URL не должна превышать {5} символов!

# UrlNotEntered
source: Please enter URL
ru_ru: Пожалуйста, введите URL

source: Window Height
ru_ru: Высота окна

# WindowHeightIsNotEntered
source: Please enter Window Height
ru_ru: Пожалуйста, укажите высоту окна

# WindowHeightIsNotInRange
source: Values of Window Height is not in acceptable range: from {0} to {1}
ru_ru: Значение высоты окна не входит в допустимый диапазон: от {0} до {1}

source: Window Width
ru_ru: Ширина окна

# WindowWidthIsNotEntered
source: Please enter Window Width
ru_ru: Пожалуйста, укажите ширину окна

# WindowWidthIsNotInRange
source: Values of Window Width is not in acceptable range: from {0} to {1}
ru_ru: Значение ширины окна не входит в допустимый диапазон: от {0} до {1}
