Repository: QuantumArt/QP
Catalog: Resources/ExternalWorkflowStrings.*.resx
Languages: ru_ru

# FillArticleMessage
source: Are you sure that you fill all article/product data?
ru_ru: Вы уверены что заполнили все данные статьи/контента?

# ApprovedRequest
source: Do you approve?
ru_ru: Подтверждаете согласование?

# ApproveComment
source: Leave your comment (optional)
ru_ru: Оставьте свой комментарий (не обязательно)

# SuccessfullyPublished
source: Workflow successfully published
ru_ru: Рабочий процесс успешно опубликован

# PublishError
source: Error while publishing workflow
ru_ru: Ошибка при публикации рабочего процесса

# SuccessfullyStarted
source: Workflow successfully started
ru_ru: Рабочий процесс успешно запущен

# StartError
source: Error while starting workflow
ru_ru: Ошибка при публикации запуске процесса

# WorkflowDisabled
source: External workflow disabled
ru_ru: Внешний workflow отключен

# WorkflowNameNotFound
source: Workflow name not found in QP article
ru_ru: Название workflow не найдено в статье QP

# SchemaNameFieldNotSpecifiedInSettings
source: Field id for schema name not specified in settings
ru_ru: Id поля имени схемы не указано в настройках

# SchemaFileFieldNotScepifiedInSettings
source: Field id for schema file not specified in settings
ru_ru: Id поля файла схемы не указано в настройках

# NoSchemasAttachedToArticle
source: No related articles with schema files was found
ru_ru: Не найдено связанных статей со схемами

source: Schema name not specified
ru_ru: Не указано имя схемы

# SchemaFileNotSpecified
source: Schema file name not specified
ru_ru: Имя файла схемы не указано

# SchemaFileNotFoundTemplate
source: Schema file was not found on disk by path {0}
ru_ru: Файл схемы не был найден на диске по пути {0}

# UnableToGetContentIdByClassifier
source: Unable to get content id by classifier field
ru_ru: Не удалось найти Id контента по полю классификатора

source: Workflow content id not specified in settings
ru_ru: Id контента workflow не указан в настройках

# WorkflowToContentRelationFieldNotFound
source: Workflow to content relation field with name ContentId not found
ru_ru: Поле связи workflow с контентом не надено, имя поля ContentId

# WorkflowToStartNotFoundTemplate
source: Unable to find assigned workflow for content {0}
ru_ru: Не удалось найти workflow назначенный для контента {0}

source: Process not started
ru_ru: Процесс не запущен

# WorkflowAssignmentFieldNotFound
source: Field with name "Workflow" not found in workflow assignments content
ru_ru: Поле с названием Workflow не найдено в контенте назначений Workflow

# WorkflowNoSetToAssignment
source: Workflow article not set for assignment
ru_ru: В назначении workflow не привязан workflow

# IsMainSchemaFieldNotFound
source: Field with name IsMainSchema not found in workflow schemas content
ru_ru: Поле с названием IsMainSchema не надено в контенте схем workflow

# SchemaIdFieldNotFound
source: Field with name SchemaId not found in workflow schemas content
ru_ru: Поле с именем SchemaId не найдено в контенте схем workflow

# DefinitionNameNotFound
source: Schema with IsMainSchema field active not found or schema id is empty
ru_ru: Не найдена схема с признаком "Главная" или в поле Id схемы не задано значение
