Repository: QuantumArt/QP
Catalog: Resources/FieldStrings.*.resx
Languages: ru_ru

# VariationAndM2OIncompatible
source: Content cannot contain both Variation and Relation Many-To-One fields
ru_ru: Контент не может одновременно содержать поле вариаций контента и связь многие-к-одному

# ListFieldTitleCount
source: Number of fields included in list item title
ru_ru: Число полей, выводимых в заголовке элемента списка

# ListIncludeRelationsInTitle
source: Include relation fields in list item title
ru_ru: Включать поля связи в заголовок элемента списка

# ListOrderByTitle
source: Default sorting by title
ru_ru: Сортировка по умолчанию по заголовку

source: List Sorting Field
ru_ru: Поле для сортировки в списке

# TreeFieldTitleCount
source: Number of fields included in tree item title
ru_ru: Число полей, выводимых в заголовке элемента дерева

# TreeIncludeRelationsInTitle
source: Include relation fields in tree item title
ru_ru: Включать поля связи в заголовок элемента дерева

# TreeOrderByTitle
source: Default sorting by title
ru_ru: Сортировка по умолчанию по заголовку

source: Use in child content filter
ru_ru: Использовать в фильтре дочернего контента

# AutoLoad
source: As Text Editor
ru_ru: Как простой текстовый редактор

source: Use type security
ru_ru: Использовать права доступа по типам

# IsLocalization
source: Is localization field
ru_ru: Является полем локализации

source: Optimize for hierarchy
ru_ru: Оптимизировать для иерархии

source: Use separate reverse views
ru_ru: Использовать отдельные обратные представления

# DisableListAutoWrap
source: Disable list auto wrapping (ul, ol, dl)
ru_ru: Отключить автоматическое оборачивание списков (ul, ol, dl)

# HighlightType
source: Type of highlight code
ru_ru: Тип подсветки кода

# LinqBackPropertyNameExistInSystemColumns
source: Such LINQ Back Property Name is already in using in system names
ru_ru: Такое имя обратного LINQ-свойства уже используется как системное

# LinqPropertyNameExistInSystemColumns
source: Such LINQ Property Name is already in using in system names
ru_ru: Такое имя LINQ-свойства уже используется как системное

# MaxDataListItemCount
source: The maximum number of items
ru_ru: Макисмальное количество элементов

# MaxDataItemCountNotInRange
source: Values of field is not in acceptable range: from {3} to {5}
ru_ru: Содержимое поля не входит в допустимый диапазон: от {3} до {5}

# BackwardFieldId
source: Backward Field
ru_ru: Обратное поле

# TraceImport
source: Trace while importing CSV
ru_ru: Трассировать при импорте CSV
