Repository: QuantumArt/QP
Catalog: Resources/FieldStrings.*.resx
Languages: ru_ru

source: Default Value
ru_ru: Значение по умолчанию

source: Disable Version Control
ru_ru: Отключить контроль версий

# FieldNotFound
source: Field not found (Id = {0})
ru_ru: Поле не найдено (Id = {0})

source: Field Type
ru_ru: Тип поля

source: Friendly Name
ru_ru: Дружественное имя

source: Indexed
ru_ru: Индексированное

# IsUnique
source: Unique
ru_ru: Уникальное

source: LINQ Back Property Name
ru_ru: Имя обратного LINQ-свойства

# LinqParamsGroup
source: LINQ Mapping Parameters
ru_ru: Параметры отображения в LINQ-классы

source: LINQ Property Name
ru_ru: Имя LINQ-свойства

# M2MRelation
source: Many-to-Many Relation
ru_ru: Связь "многие-ко-многим"

# MapAsProperty
source: Map as LINQ Property
ru_ru: Отображать как LINQ-свойство

# MapLinkAsClass
source: Map Junction Table as Class
ru_ru: Отображать узловую таблицу как класс

# NetLinkName
source: LINQ Junction Class Name (singular)
ru_ru: Имя узлового LINQ-класса (единственное)

# NetPluralLinkName
source: LINQ Junction Class Name (plural)
ru_ru: Имя узлового LINQ-класса (множественное)

# O2MRelation
source: One-to-Many Relation
ru_ru: Связь "один-ко-многим"

# OnScreen
source: Enable OnScreen
ru_ru: Разрешить OnScreen

source: Read-only
ru_ru: Только для чтения

# RelatedFieldIsNotFound
source: Related field (Id = {1}) for field (Id = {0}) is not found
ru_ru: Для поля (Id = {0}) не найдено связанное поле (Id = {1})

source: Relate To
ru_ru: Связать с

source: Relation Condition
ru_ru: Условие на связь

# RelationFieldIsNull
source: The related field is not set in the One-to-Many relation field (Id = {0})
ru_ru: Для поля связи "один-ко-многим" (Id = {0}) не установлено связанное поле

# RelationId
source: Display Field
ru_ru: Показать поле

# RenameMatched
source: Rename Matched Files
ru_ru: Переименовывать совпадающие файлы

source: Required
ru_ru: Обязательное

# SubFolder
source: File Subfolder
ru_ru: Подпапка для файлов

# TypeSpecificParamsGroup
source: Type-specific parameters
ru_ru: Параметры, зависящие от типа

# UniqueInCombinationWith
source: In combination with
ru_ru: В комбинации с

source: Use Relation Condition
ru_ru: Использовать условие на связь

source: Use Site Library
ru_ru: Использовать библиотеку сайта

source: View in List
ru_ru: Просмотреть в списке

# BasicInputMask
source: Basic
ru_ru: Базовая

# CustomInputMask
source: Custom
ru_ru: Настраиваемая

# FullPage
source: Enable full HTML pages
ru_ru: Разрешить целые HTML-страницы

source: Input Mask
ru_ru: Маска ввода

source: Input Mask Type
ru_ru: Тип маски ввода

# PEnterMode
source: Insert P tag while pressing Enter
ru_ru: Вставлять тег P при нажатии Enter

# StringSize
source: Size
ru_ru: Размер

# TextBoxRows
source: Rows
ru_ru: Строки

source: Use Input Mask
ru_ru: Использовать маску ввода

# VisualEditorHeight
source: Height
ru_ru: Высота

# BaseImage
source: Based On
ru_ru: Основано на

# DynamicImageHeigth
source: Height
ru_ru: Высота

# DynamicImageMode
source: Mode
ru_ru: Режим

# DynamicImageModeHeight
source: Limit Height
ru_ru: Ограничить по высоте

# DynamicImageModeSize
source: Limit Size
ru_ru: Ограничить размеры

# DynamicImageModeWidth
source: Limit Width
ru_ru: Ограничить по ширине

# DynamicImageQuality
source: Quality (%)
ru_ru: Качество (%)

# DynamicImageType
source: Output File Type
ru_ru: Тип файла на выходе

# DynamicImageWidth
source: Width
ru_ru: Ширина

# IsInteger
source: Integer
ru_ru: Целое

source: Select field
ru_ru: Выберите поле

source: Backward field name
ru_ru: Имя обратного поля

# Order
source: Place
ru_ru: Разместить

# OrderOptionAfterAll
source: After Existing Fields
ru_ru: После существующих полей

# OrderOptionTemplate
source: Before {0}
ru_ru: Перед полем {0}

# DefaultAndUniqueBothAreSet
source: Field can not be Unique and has Default Value at the same time
ru_ru: Поле не может быть одновременно уникальным и иметь значение по умолчанию

# FriendlyNameMaxLengthExceeded
source: The length of field friendly name should not exceed {5} characters
ru_ru: Длина дружественного имени поля не должна превышать {1} символов

# ReadOnlyAndRequiredBothAreTrue
source: Field can not be Read-only and Required at the same time
ru_ru: Поле не может быть одновременно обязательным и "только для чтения"

# BackwardFieldNameAndNameAreEqual
source: Field Name and Backward Field Name have to be different
ru_ru: Имя поля и имя обрантого поля должны отличаться

# BackwardFieldNameInvalidFormat
source: Invalid Backward Field Name format
ru_ru: Некорректное имя обратного поля

# BackwardFieldNameMaxLengthExceeded
source: The length of Backward Field Name should not exceed {5} characters!
ru_ru: Длина имени обратного поля не должна превышать {1} символов!

# BackwardFieldNameNotEntered
source: Please enter Backward Field Name
ru_ru: Пожалуйста, введите имя обрантого поля

# BaseImageNotSelected
source: Please select image which field is based on
ru_ru: Пожалуйста, выберите поле-изображение в качестве основы

# FieldValueIsNotInRange
source: Values of field is not in acceptable range: from {0} to {1}
ru_ru: Содержимое поля не входит в допустимый диапазон: от {0} до {1}

# FieldValueLengthExceeded
source: The length of field value should not exceed {0} characters!
ru_ru: Длина содержимого поля не должна превышать {0} символов!

# DecimalPlacesNotInRange
source: Decimal Places is not in acceptable range: from 0 to 25
ru_ru: Количество цифр после запятой не входит в допустимый диапазон: от 0 до 25

# DefaultMaxLengthExceeded
source: The length of Default Value should not exceed 255 characters!
ru_ru: Длина значения по умолчанию не должна превышать 255 символов!

# DocTypeMaxLengthExceeded
source: The length of DocType should not exceed {5} characters!
ru_ru: Длина значения DocType не должна превышать {1} символов!

# DynamicImageHeightNotInRange
source: Value of Height is not in acceptable range: from 1 to 9999
ru_ru: Значение высоты не входит в допустимый диапазон: от 1 до 9999

# DynamicImageQualityNotEntered
source: Please enter Quality value
ru_ru: Пожалуйста, введите значение качества

# DynamicImageQualityNotInRange
source: Value of Quality is not in acceptable range: from 50 to 100
ru_ru: Значение качества не входит в допустимый диапазон: от 50 до 100

# DynamicImageWidthNotInRange
source: Value of Width is not in acceptable range: from 1 to 9999
ru_ru: Значение ширины не входит в допустимый диапазон: от 1 до 9999

# InputMaskMaxLengthExceeded
source: The length of Input Mask should not exceed {5} characters!
ru_ru: Длина маски ввода не должна превышать {1} символов!

# InputMaskNotEntered
source: Please enter Input Mask
ru_ru: Пожалуйста, укажите маску ввода

# LinqBackPropertyNameInvalidFormat
source: Invalid LINQ Back Property Name format
ru_ru: Некорректное имя LINQ-свойства

# LinqBackPropertyNameMaxLengthExceeded
source: The length of LINQ Back Property Name should not exceed {5} characters!
ru_ru: Длина имени обратного LINQ-свойства не должна превышать {1} символов!

# LinqBackPropertyNameNonUnique
source: Such Back LINQ Property Name is already in using
ru_ru: Такое имя обратного LINQ-свойства уже используется

# LinqBackPropertyNameNotEntered
source: Please enter LINQ Back Property
ru_ru: Пожалуйста, введите имя обратного LINQ-свойства

# LinqPropertyNameInvalidFormat
source: Invalid LINQ Property Name format
ru_ru: Некорректное имя обратного LINQ-свойства

# LinqPropertyNameMaxLengthExceeded
source: The length of LINQ Property Name should not exceed {5} characters!
ru_ru: Длина имени LINQ-свойства не должна превышать {1} символов!

# LinqPropertyNameNonUnique
source: Such LINQ Property Name is already in using
ru_ru: Такое имя LINQ-свойства уже используется

# LinqPropertyNameNotEntered
source: Please enter LINQ Property Name
ru_ru: Пожалуйста, введите имя LINQ-свойства

# LinqPropertyNamesAreEqual
source: LINQ Property Name and LINQ Back Property Name have to be different
ru_ru: Имя LINQ-свойства и имя обратного LINQ-свойства должны различаться

# NetLinkNameInvalidFormat
source: Invalid LINQ Junction Class Name (singular) format
ru_ru: Некорректное имя узлового LINQ-класса (единственное)

# NetLinkNameMaxLengthExceeded
source: The length of LINQ Junction Class Name (singular) should not exceed {5} characters!
ru_ru: Длина имени узлового LINQ-класса (единственное) не должна превышать {1} символов!

# NetLinkNameNonUnique
source: Such LINQ Junction Class Name (singular) is already in using
ru_ru: Такое имя узлового LINQ-класса (единственное) уже используется

# NetLinkNameNotEntered
source: Please enter LINQ Junction Class Name (singular)
ru_ru: Пожалуйста, введите имя узлового LINQ-класса (единственное)

# NetLinkNamesAreEqual
source: LINQ Junction Class Names (singular and plural) have to be different
ru_ru: Имена LINQ-класса (единственное и множественное) должны различаться

# NetPluralLinkNameInvalidFormat
source: Invalid LINQ Junction Class Name (plural) format
ru_ru: Некорректное имя узлового LINQ-класса (множественное)

# NetPluralLinkNameMaxLengthExceeded
source: The length of LINQ Junction Class Name (plural) should not exceed {5} characters!
ru_ru: Длина имени узлового LINQ-класса (множественное) не должна превышать {1} символов!

# NetPluralLinkNameNonUnique
source: Such LINQ Junction Class Name (plural) is already in using
ru_ru: Такое имя узлового LINQ-класса (множественное) уже используется

# NetPluralLinkNameNotEntered
source: Please enter LINQ Junction Class Name (plural)
ru_ru: Пожалуйста, введите имя узлового LINQ-класса (множественное)

# RelateToContentNotSelected
source: "Relate to" is not selected
ru_ru: Не выбран контент с которым связано поле

# RelationConditionMaxLengthExceeded
source: The length of Relation Condition should not exceed {5} characters!
ru_ru: Длина условия на связь не должна превышать {1} символов!

# RelationIdNotSelected
source: Display Field is not selected
ru_ru: Для связи не выбрано поле для показа

# StringLengthNotInRange
source: Value of String Length is not in acceptable range: from 1 to 3500
ru_ru: Длина строки не входит в допустимый диапазон: от 1 до 3500

# SubFolderMaxLengthExceeded
source: The length of File Subfolder name should not exceed {5} characters!
ru_ru: Длина имени подпапки для файлов не должна превышать {1} символов!

# TextboxRowsNotInRange
source: Value of Rows is not in acceptable range: from 5 to 30
ru_ru: Количество строк не входит в допустимый диапазон: от 5 до 30

# VisualEditHeightNotInRange
source: Value of Height is not in acceptable range: from 350 to 750
ru_ru: Высота не входит в допустимый диапазон: от 350 до 750

# FieldHasBadValues
source: Field has an inadmissible values
ru_ru: Поле имеет недопустимые значения

# MultiplyUniqueConstraint
source: Field is included in multiple unique constraint
ru_ru: Поле участвует в сложном ограничении уникальности

# RelatedFieldsExist
source: There are fields which are related to the current field
ru_ru: Существуют поля, которые ссылаются на поле

# ThumbnailsExist
source: There are Dynamic Images for the current field
ru_ru: Существуют динамические изображения для поля

source: Decimal Places
ru_ru: Количество цифр после запятой

# SizeTitle
source: Size/Decimal Places
ru_ru: Размер

source: Select content
ru_ru: Выберите контент

source: No fields
ru_ru: Поля отсутствуют

# SubFolderInvalidFormat
source: Invalid Subfolder format
ru_ru: Некорректный путь к подпапке для файлов

# SelectMaskTemplate
source: Select basic input mask
ru_ru: Выберите базовую маску

# MatchNameConflict
source: The field "{0}" already exists in the content "{1}"
ru_ru: Поле "{0}" уже существует в контенте "{1}"

# BaseImageIdMismatch
source: The base image of the field "{0} in the content "{2}" mismatches the base image of the field "{1}" in the content "{3}"
ru_ru: Изображение, на котором основано поле "{0} в контенте "{2}", не совпадает с изображением, на котором основано поле "{1}" в контенте "{3}"

# MatchTypeConflict
source: The type of field "{0}" in the content "{2}" mismatches the type of field "{1}" in the content "{3}"
ru_ru: Тип поля "{0}" в контенте "{2}" не совпадает с типом поля "{1}" в контенте "{3}"

# MatchUseSiteLibraryConflict
source: "Use Site Library" values of the field "{0}" in the content "{2}" and the field "{1}" in the content "{3}" mismatch
ru_ru: Значение свойства "Использовать библиотеку сайта" не совпадает у поля "{0}" в контенте "{2}" и поля "{1}" в контенте "{3}"

# RelateToContensMismatch
source: The content related by the the field "{0}" in the content "{2}" mismatches the content related by the the field "{1}" in the content "{3}"
ru_ru: Контент на который ссылается поле "{0}" в контенте "{2}" не совпадает с контентом, на который ссылается поле "{1}" в контенте "{3}"

# VirtualChildrenFieldsExist
source: Fields could not be changed because there are inherited fields in the virtual JOIN contents
ru_ru: Поле не может быть изменено, так как существуют дочерние поля в виртуальных контентах типа JOIN

# UseEnglishQuotes
source: Use english typografic rules
ru_ru: Использовать правила английской типографики

# M2ORelation
source: Many-to-One Relation
ru_ru: Связь "многие-к-одному"

# BackRelationId
source: Base relation field
ru_ru: Базовое поле связи

# BackRelationIdNotSelected
source: Base relation field is not selected
ru_ru: Базовое поле связи не выбрано

# CannotChangeRelationTypeForSelfRelation
source: You cannot change relation type for the field that related to the same content
ru_ru: Невозможно сменить тип связи для поля, которое ссылается на тот же контент

# BackRelationContentNotAssignedAsyncWorkflow
source: The content for base relation field has not assigned workflow with article splitting
ru_ru: На контент базового поля связи не назначено workflow с расщеплением статей

# CannotCreateUniqueFieldBecauseOfExisting
source: You cannot create field with unique constraint because the current content contains more than one article
ru_ru: Невозможно создать поле с ограничением уникальности, потому что текущий контент содержит более одной статьи

# ExistingDataIsNotUnique
source: Existing article data is not unique. Duplicates found: {0}
ru_ru: Существующие данные статей не уникальны. Найдено дубликатов: {0}

# CannotChangeTypeToNotRelateable
source: You cannot change field type because fields related to this field already exist
ru_ru: Невозможно изменить тип поля, так как существуют поля ссылающиеся на него

source: Default Value is not defined
ru_ru: Значение по умолчанию не определено

# ApplyDefaultValueStageName
source: Applying default value
ru_ru: Применение значения по умолчанию

# FieldIsNotDynamicImage
source: Type of field (Id:{0}) is not Dynamic Image
ru_ru: Поле (Id:{0}) не является динамическим изображением

# RecreateDynamicImagesStageName
source: Recreating dynamic images
ru_ru: Пересоздание динамических изображений

# IsLong
source: Use Int64 data type
ru_ru: Использовать тип данных Int64

# IsDecimal
source: Use Decimal data type
ru_ru: Использовать тип данных Decimal

source: Auto Expand
ru_ru: Автоматическое раскрытие

# AutoCheckChildren
source: Auto check child articles
ru_ru: Автоматически отмечать дочерние статьи

source: Use for tree
ru_ru: Использовать для дерева

# UseForTreeAlreadySet
source: Use For Tree option is already set for the field "{0}"
ru_ru: Опция "Использовать для дерева" уже установлена для поля "{0}"

source: Rebuild virtual contents
ru_ru: Пересобрать виртуальные контенты

# DisablingRebuildIsDangerous
source: Switching Rebuild Virtual Contents option off may cause errors in these virtual contents. This option is intended for advanced users and used for fine performance tuning.
ru_ru: Отключение опции 'Пересобрать виртуальные контенты' может привести к ошибкам в этих виртуальных контентах. Данная опция предназначена для опытных пользователей и служит для тонкой настройки производительности.

source: Aggregated
ru_ru: Агрегированное

# ClassifierId
source: Classifier
ru_ru: Классификатор

# AggregatedIsComplexUnique
source: Aggregated Field is included in multiple unique constraint
ru_ru: Агрегированное поле участвует в сложном ограничении уникальности

# AggregatedIsNotUnique
source: Aggregated Field must be unique
ru_ru: Агрегированное поле должно быть уникальным

# AggregatedRelateToCurrentContent
source: Aggregated Field can not relate to the current Content
ru_ru: Агрегированное поле не может ссылаться на текущий контент

# CannotSetAggregateBecauseOfExisting
source: You cannot set "Aggregated" because the current content contains articles
ru_ru: Невозможно сделать поле агрегированным, потому что текущий контент содержит статьи

# ClassifierRefNotSelected
source: Classifier is not selected
ru_ru: Классификатор не выбран

# ThereAreAggregatedsInRootContent
source: There is another Aggregated Field is in the Related Content
ru_ru: Корневой контент содержит агрегированное поле

# ThereIsAggregatedInContent
source: There is another Aggregated Field is in the current Content
ru_ru: Текущий контент содержит агрегированное поле

# CannotResetAggregateBecauseOfExisting
source: You cannot reset "Aggregated" because the current content contains articles
ru_ru: Невозможно сделать поле неагрегированным, потому что текущий контент содержит статьи

# RelatedContentAutoArchiveIsDifferent
source: "Auto Archive" property of Related Content is different of appropriate property of current Content
ru_ru: Значение свойства "Архивировать при удалении" связанного контента отличается от соответствующего свойства текущего контента

# RelatedContentWorkflowIsDifferent
source: Workflow of Related Content is different of Workflow of current Content
ru_ru: Workflow связанного контента отличается от Workflow текущего контента

# RelatedContentWorkflowSplitIsDifferent
source: "Split Articles" property of Related Content is different of appropriate property of current Content
ru_ru: Значение свойства "Расщеплять статьи" связанного контента отличается от соответствующего свойства текущего контента

# CannotChangeAggregateFieldTypeBecauseOfExisting
source: You cannot change Field Type because the field is aggregated and current content contains articles
ru_ru: Невозможно изменить тип поля, потому оно является агрегированным и текущий контент содержит статьи

# CannotChangeClassifierRefBecauseOfExisting
source: You cannot change Classifier because the field is aggregated and current content contains articles
ru_ru: Невозможно изменить классификатор, потому что поле является агрегированным и текущий контент содержит статьи

# CannotRemoveAggregated
source: Aggregated field could not be removed because the current content contains articles
ru_ru: Агрегированное поле не может быть удалено, потому что текущий контент содержит статьи

# CannotSetAggregateBecauseOfNotification
source: You cannot set "Aggregated" because there are notifications for the current content
ru_ru: Невозможно сделать поле агрегированным, потому что существуют уведомления для текущего контента

# CannotRemoveClassifier
source: Classifier field could not be removed because there are related Aggregated fields
ru_ru: Классификатор не может быть удален, потому что существуют связанные с ним агрегированные поля

# CannotRemoveChildField
source: Child field could not be removed
ru_ru: Дочернее поле не может быть удалено

# ClassiferCannotBeReadonly
source: Classifier could not be read only
ru_ru: Классификатор не может быть доступен только для чтения

# ClassiferCannotBeUniq
source: Classifier could not be with with unique constraint
ru_ru: Классификатор не может иметь ограничения уникальности

# CannotChangeClassifierType
source: Classifier type could not be changed because there are related Aggregated fields
ru_ru: Тип классификатора не может быть изменен, потому что существуют связанные с ним агрегированные поля

source: Changeable
ru_ru: Изменяемое поле

# ClassifierDefaultIsUndefined
source: Value is undefined
ru_ru: Значение не определено

# CannotChangeAggregateFieldTypeBecauseOfClassifierDefaultValue
source: You cannot change Field Type because the field is aggregated and the current Content is classifier default value
ru_ru: Невозможно изменить тип поля, потому оно является агрегированным и текущий контент контент является значением классификатора по умолчанию

# CannotChangeClassifierRefBecauseOfClassifierDefaultValue
source: You cannot change Classifier because the field is aggregated and the current Content is classifier default value
ru_ru: Невозможно изменить классификатор, потому оно является агрегированным и текущий контент контент является значением классификатора по умолчанию

# CannotRemoveAggregatedBecauseOfClassifierDefaultValue
source: Aggregated field could not be removed because the current content is classifier default value
ru_ru: Агрегированное поле не может быть удалено, потому что текущий контент является значением классификатора по умолчанию

# CannotResetAggregateBecauseOfClassifierDefaultValue
source: You cannot reset "Aggregated" because the current content is classifier default value
ru_ru: Невозможно сделать поле неагрегированным, потому что текущий контент является значением классификатора по умолчанию

# CopyPermissionsToChildren
source: Ð¡opy permissions while creating children
ru_ru: Копировать права доступа при создании дочерних элементов

source: Relation security field must be required
ru_ru: Поле связи, для которого используются права доступа, должно быть обязательным

# UseRelationSecurity
source: Use related permissions
ru_ru: Использовать связанные права доступа

source: String Enum
ru_ru: Строковое перечисление

# EnumValues
source: Values
ru_ru: Значения

# ShowAsRadioButtons
source: Show as Radio Button Group
ru_ru: Использовать группу радиокнопок

source: Add New Enum Item
ru_ru: Добавить новый элемент

# EnumValueAlias
source: Alias
ru_ru: Псевдоним

# EnumValueDefault
source: Default
ru_ru: По умолчанию

# EnumValueIsDefault
source: This is Default Value
ru_ru: Значение по умолчанию

# EnumValueValue
source: Value
ru_ru: Значение

# EnumValueIsInvalid
source: Name and Alias have to be defined for each enum items.
ru_ru: Имя и псевдоним должны быть определены для каждого элемента перечисления.

# EnumValueIsNotDefined
source: Has to be defined at least one enum item.
ru_ru: Должен быть определен как минимум один элемент перечисления.

# EnumValueAliasIsNotUnique
source: The Aliases must be unique
ru_ru: Псевдонимы должны быть уникальными

# EnumValueValueIsNotUnique
source: The Values must be unique
ru_ru: Значения должны быть уникальными

# NonEnumFieldValueExist
source: There are current field values which are not a member of enum
ru_ru: Существуют значения текущего поля не входящие в перечисление

# SelectEnumValue
source: Select Value
ru_ru: Выберите значение

source: Symmetric
ru_ru: Симметричное

# VirtualBackwardFieldIsNotAllowed
source: Backward Field could not be created because of the current field is related to the Virtual Content
ru_ru: Обратное поле не может быть создано так как текущее поле ссылается на виртуальный контент

source: Use for Default Filtration
ru_ru: Использовать для фильтрации по умолчанию

source: Tree Sorting Field
ru_ru: Поле для сортировки в дереве

# UnableToCopyM2O
source: Unable to copy Relation Many-to-One field
ru_ru: Невозможно скопировать поле типа Relation Many-to-One

source: Unable To Copy Classifier
ru_ru: Невозможно копировать поле типа классификатор

# UnableToCopyAggregator
source: Unable To Copy Aggregator field
ru_ru: Невозможно копировать поле типа Aggregator

# UnableToCopyUnique
source: Unable To Copy Unique Field
ru_ru: Невозможно скопировать уникальное поле

source: Parent field
ru_ru: Родительское поле

source: Hide
ru_ru: Скрыть

source: Override
ru_ru: Переопределить

# UseForContext
source: Use for context selection
ru_ru: Использовать для выбора контекста

# UseForVariations
source: Use for content variations
ru_ru: Использовать для вариаций контента
