Repository: QuantumArt/QP
Catalog: Resources/ImportStrings.*.resx
Languages: ru_ru

source: All Fields
ru_ru: Все поля

source: Custom Fields
ru_ru: Пользовательские поля

# DateTimeFormatError
source: DateTime format error for '{0}'
ru_ru: Ошибка в формате даты для значения '{0}'

# DenyPastDates
source: Value '{0}' is earlier than current date
ru_ru: Значение '{0}' раньше текущей даты

# ErrorInColumn
source: Error while processing line {0}, column '{1}': {2}
ru_ru: Ошибка при обработке строки {0} в столбце '{1}': {2}

# ErrorInRequiredColumn
source: Error while processing line {0}, column '{1}': Required field '{2}' is empty
ru_ru: Ошибка при обработке строки {0} в столбце '{1}': Обязательное поле '{2}' - пустое

source: Exclude System Fields
ru_ru: Исключить системные поля

# FieldsToExpand
source: Relation Fields to Expand
ru_ru: Развернуть поля связей

# FirstLineEmpty
source: First line of the uploaded file is empty"
ru_ru: Первая строка загруженного файла - пустая

# ImportInterrupted
source: Import has been interrupted: {0}. Last successfully processed line: {1}
ru_ru: Импорт был прерван: {0}. Последняя успешно обработанная строка: {1}

# IncorrectM2M
source: A try to save incorrect M2M Relation value occured (article: {0}, field: {1}, non-existing related articles: {2})
ru_ru: Произошла попытка сохранить некорректное значение связи М2M (статья: {0}, поле: {1}, несуществующие связанные статьи: {2})

# IncorrectO2M
source: A try to save incorrect O2M Relation value occured (article: {0}, field: {1}, non-existing related article: {2})
ru_ru: Произошла попытка сохранить некорректное значение связи O2M (статья: {0}, поле: {1}, несуществующая связанная статья: {2})

# InvalidIdentity
source: Specified field is not a valid identity for article
ru_ru: Заданное поле не явлется уникальным идентификатором для статьи

# LineFormatException
source: Line format exception: {0}
ru_ru: Ошибка формата строки: {0}

# M2MFormatError
source: Relation M2M format error for '{0}'
ru_ru: Ошибка в формате связи М2M для значения '{0}'

# MissedColumn
source: There is no column '{0}' in the specified file
ru_ru: В выбранном файле нет столбца '{0}'

# NoLines
source: There is no lines in selected file
ru_ru: Выбранный файл не содержит строк с данными

# NumberFormatError
source: Number format error for '{0}'
ru_ru: Ошибка в формате числа для значения '{0}'

# O2MFormatError
source: Relation O2M format error for '{0}'
ru_ru: Ошибка в формате связи O2M для значения '{0}'

source: Select Fields
ru_ru: Выберите поля

# UniqueNotSpecified
source: You didn't specify unique field for article. Please select it from dropdown list.
ru_ru: Вы не задали уникальное поле для статьи. Пожалуйста, выберите его из списка.

# InaccessibleM2M
source: A try to save incorrect M2M Relation value occured (article: {0}, field: {1}, inaccessible related articles: {2})
ru_ru: Произошла попытка сохранить некорректное значение связи М2M (статья: {0}, поле: {1}, недоступные связанные статьи: {2})

# InaccessibleO2M
source: A try to save incorrect O2M Relation value occured(article: {0}, field: {1}, inaccessible related article: {2})
ru_ru: Произошла попытка сохранить некорректное значение связи O2M (статья: {0}, поле: {1}, недоступная связанная статья: {2})

# UpdateSecurityViolation
source: Articles couldn't be updated because of insufficient permissions (ID: {0})
ru_ru: Статьи не могут быть обновлены из-за недостаточных прав доступа (ID: {0})

# UpdateRelationSecurityViolation
source: Articles couldn't be updated because of insufficient relation permissions (ID: {0})
ru_ru: Статьи не могут быть обновлены из-за недостаточных прав доступа на связи (ID: {0})

# UpdateLockedByViolation
source: Articles couldn't be updated because of locking by other users (ID: {0})
ru_ru: Статьи не могут быть обновлены из-за блокировки другими пользователями (ID: {0})

# BoolFormatError
source: Boolean format error for '{0}'
ru_ru: Ошибка в формате булева значения'{0}'

# InaccessibleByWorkflow
source: A try to save articles inaccessible by workflow: {0}
ru_ru: Произошла попытка сохранить статьи, недоступные по workflow: {0}
