Repository: QuantumArt/QP
Catalog: Resources/LogOnStrings.*.resx
Languages: ru_ru

# Button_Login
source: Login
ru_ru: Войти

source: Customer code
ru_ru: Код клиента

# ErrorMessage_AccountBlocked
source: Your account is blocked!
ru_ru: Ваша учетная запись заблокирована!

# ErrorMessage_AccountNotExist
source: Your account does not exist!
ru_ru: Ваша учетная запись не существует!

# ErrorMessage_AutoLoginDisabled
source: Auto-login is disabled for your account!
ru_ru: Авто-вход отключен для Вашей учетной записи!

# ErrorMessage_CustomerCodeNotExist
source: Customer code does not exist!
ru_ru: Введенный Вами код клиента не существует!

# ErrorMessage_NotEnteredCustomerCode
source: You not entered customer code!
ru_ru: Вы не ввели код клиента!

# ErrorMessage_NotEnteredLogin
source: You not entered login!
ru_ru: Вы не ввели логин!

# ErrorMessage_NotEnteredPassword
source: You not entered password!
ru_ru: Вы не ввели пароль!

# ErrorMessage_SessionExpired
source: Your session expired. Please, logoff.
ru_ru: Ваша сессия истекла. Пожалуйста, выйдите из системы.

# ErrorMessage_UnknownAuthenticationError
source: During authentication, an unknown error occurred!
ru_ru: Во время аутентификации произошла неизвестная ошибка!

# ErrorMessage_WindowsAccountNotAssociatedQPUser
source: Your Windows account is not associated to user QP!
ru_ru: Ваша учетная запись Windows не привязана ни к одному пользователю QP!

# ErrorMessage_WrongPassword
source: You entered wrong password!
ru_ru: Вы неправильно ввели пароль!

# ErrorSummary_AuthenticationErrors
source: When you entered login and password have following errors:
ru_ru: При вводе логина и пароля возникли следующие ошибки:

# InfoMessage_AutoLogin
source: You are logged in to QP8.CMS with PostgreSQL support as {0}. If you want to log in with another user account, click <a href="{1}">here</a>.
ru_ru: Вы вошли в QP8.CMS с поддержкой PostgreSQL как {0}. Если Вы хотите войти под учетной записью другого пользователя, то щелкните <a href="{1}">здесь</a>.

# InfoMessage_ManualLogin
source: You are logged in to QP8.CMS with PostgreSQL support as {0}. If you want to log in with this account, click <a href="#">here</a>.
ru_ru: Вы вошли в QP8.CMS с поддержкой PostgreSQL как {0}. Если Вы хотите войти под своей учетной записью, то щелкните <a href="#">здесь</a>.

# InfoMessage_Welcome
source: Welcome To QP8.CMS with PostgreSQL support!
ru_ru: Добро пожаловать в QP8.CMS с поддержкой PostgreSQL!

source: Password
ru_ru: Пароль

# UserName
source: Login
ru_ru: Логин

# VersionsAreDifferent
source: Database version ({0}) doesn't match backend version ({1})
ru_ru: Версия базы данных ({0}) не совпадает с версией бэкенда ({1})

# ErrorMessage_SSO_DefaultMessage
source: Unable to authenticate with SSO, please contact your system administrator.
ru_ru: Не удалось войти через SSO, пожалуйста. обратитесь к Вашему системному администратору.

# ErrorMessage_SSO_Retry
source: Error while authenticating with SSO, please try again.
ru_ru: Ошибка при входе через SSO, пожалуйста, повторите попытку.

# ErrorMessage_SSO_Disabled
source: SSO disabled for this customer code
ru_ru: SSO отключено для этого выбранного кода клиента

# ErrorMessage_IntegratedAccountsDisabled
source: Integrated accounts disabled
ru_ru: Встроенные учётные записи отключены
