Repository: QuantumArt/QP
Catalog: Resources/MultistepActionStrings.*.resx
Languages: ru_ru

source: Action has already run
ru_ru: Действие уже выполняется

# ArchiveArticlesCommand
source: Archive articles
ru_ru: Архивация статей

# CR
source: CR (early MacOS style)
ru_ru: CR (стиль ранних MacOS)

source: Downloaded file
ru_ru: Загруженный файл

source: Field delimiter
ru_ru: Разделитель полей

# FlagForChangedStatus
source: There is a flag for changed status in column IsChanged (1 / 0)
ru_ru: В колонке IsChanged указано изменена ли статья или нет (1 / 0)

source: Format settings
ru_ru: Настройки формата

source: Import
ru_ru: Импорт

# ImportAction
source: Choose action on import
ru_ru: Выберите действие при импорте

# ImportComma
source: Comma (,)
ru_ru: Запятая (,)

# ImportCulture
source: Select a culture
ru_ru: Выберите культуру

# ImportEncoding
source: Select an encoding
ru_ru: Выберите кодировку

# ImportNoHeaders
source: First line doesnt contain column titles
ru_ru: Первая строка не содержит названия полей

# ImportSemicolon
source: Semicolon (;)
ru_ru: Точка с запятой (;)

# ImportTab
source: Tab ( )
ru_ru: Табуляция ( )

# InsertedArticles
source: Inserted
ru_ru: Добавлено

source: Line separator
ru_ru: Разделитель строк

source: Link for download file
ru_ru: Ссылка для скачивания файла

source: Mapping fields
ru_ru: Соответствия полей

# NoFile
source: File is not selected
ru_ru: Файл не выбран

# NoFileError
source: File was either not specified or downloaded
ru_ru: Файл не был указан или не загружен

source: Order by field
ru_ru: Сортировать по полю

# PublishArticlesCommand
source: Publish articles
ru_ru: Публикация статей

# RemoveArticlesCommand
source: Remove articles
ru_ru: Удаление статей

# RemoveArticlesFromArchiveCommand
source: Remove articles from archive
ru_ru: Удаление статей из архива

# RestoreArticlesCommand
source: Restore articles
ru_ru: Восстановление статей

# SelectDelimiter
source: Select a delimiter
ru_ru: Выберите разделители

# SelectFile
source: Select a file
ru_ru: Выберите файл

# SettingsOnInsert
source: Insert and Update Settings
ru_ru: Параметры вставки и обновления

source: Site settings
ru_ru: Настройки сайта

# UniqueContentFieldToUpdate
source: Select content field that will be used for matching articles
ru_ru: Выберите поле контента, по которому будет осуществлено сопоставление статей

# UniqueFieldToUpdate
source: Select identifier field that will be used for matching articles
ru_ru: Выберите поле идентификатора, по которому будет осуществлено сопоставление статей

# UpdatedArticles
source: Updated
ru_ru: Обновлено

# CreateVersions
source: Create versions while updating articles
ru_ru: Создавать версии при обновлении статей

# LF
source: LF (Linux style)
ru_ru: LF (Linux-стиль)

# CRLF
source: CRLF (Windows style)
ru_ru: CRLF (Windows-стиль)
