Repository: QuantumArt/QP
Catalog: Resources/NotificationStrings.*.resx
Languages: ru_ru

source: Add New Notification
ru_ru: Добавить новое уведомление

source: Basic Parameters
ru_ru: Основные параметры

# ForCreate
source: Create
ru_ru: Создание

# ForFrontend
source: Request On Demand
ru_ru: Запрос по требованию

source: Format
ru_ru: Формат

# ForModify
source: Modify
ru_ru: Изменение

# ForRemove
source: Remove
ru_ru: Удаление

# ForStatusChanged
source: Status Changed
ru_ru: Изменение статуса

# ForStatusPartiallyChanged
source: Status Partially Changed
ru_ru: Частичное изменение статуса

# NotificationNotFound
source: Notification Not Found (Id = {0})
ru_ru: Уведомление не найдено (Id = {0})

source: Receiver
ru_ru: Получатель

source: Status
ru_ru: Статус

source: Events
ru_ru: События

source: Sender
ru_ru: Отправитель

source: Options
ru_ru: Опции

source: Use Default Sender Name
ru_ru: Использовать имя отправителя по умолчанию

source: Default Sender Name
ru_ru: Имя отправителя по умолчанию

source: Sender Name
ru_ru: Имя отправителя

source: Use QP8 User Email
ru_ru: Использовать e-mail пользователя QP8

# SendFiles
source: Send Files As Attachments
ru_ru: Посылать файлы как вложения

# UseQaMail
source: Use QA_Mail component in QP7 Backend
ru_ru: Использовать компонент QA_Mail в бэкенде QP7

source: QP8 User
ru_ru: Пользователь QP8

source: User
ru_ru: Пользователь

source: User Group
ru_ru: Группа пользователей

source: Field
ru_ru: Поле

source: Receiver Type
ru_ru: Тип получателя

# FormatIdNotEntered
source: Please select format
ru_ru: Пожалуйста, выберите формат!

source: Create Default Format
ru_ru: Создать формат по умолчанию

# SenderNameNotEntered
source: Please enter sender name!
ru_ru: Пожалуйста, введите имя отправителя!

# SenderNameMaxLengthExceeded
source: The length of login should not exceed {0} characters!
ru_ru: Длина имени отправителя не должна превышать {0} символов

# SenderEmailNotEntered
source: Please enter sender e-mail!
ru_ru: Пожалуйста, введите e-mail отправителя!

# SenderEmailNotValid
source: Please enter valid sender e-mail!
ru_ru: Введенный e-mail отправителя невалидный!

# UserNotSelected
source: Please select user
ru_ru: Пожалуйста, выберите пользователя!

# FieldNotSelected
source: Please select field
ru_ru: Пожалуйста, выберите поле!

# UserGroupNotSelected
source: Please select user group
ru_ru: Пожалуйста, выберите группу пользователей!

source: Unbind
ru_ru: Отвязать

# UnbindedMessage
source: Notification was unbinded from workflow
ru_ru: Уведомление было отвязано от workflow

# RadioEveryone
source: Everyone In History
ru_ru: Все в истории изменений

# RadioFromArticle
source: E-mail From Article Field
ru_ru: E-mail из поля статьи

# RadioFromContent
source: E-mail From Content
ru_ru: E-mail из контента

# RadioNone
source: None
ru_ru: Нет получателя

# RadioUser
source: User
ru_ru: Пользователь

# RadioUserGroup
source: User Group
ru_ru: Группа пользователей

# EventNotSelected
source: Please select at least one event
ru_ru: Пожалуйста, выберите хотя бы одно событие!

source: Any Status
ru_ru: Любой статус

source: Choose Field
ru_ru: Выберите поле

source: Choose Format
ru_ru: Выберите формат

# SenderEmailLengthExceeded
source: The length of E-mail should not exceed {0} characters!
ru_ru: Длина e-mail`а отправителя не должна превышать {0} символов

# WarningString
source: This notification is default and bound to workflow ({0}).
ru_ru: Данное уведомление является сгенерированным по умолчанию и привязано к Workflow ({0}).

source: External
ru_ru: Внешнее

source: External URL
ru_ru: Внешний URL

# UseService
source: Use service for sending
ru_ru: Использовать сервис для отправки

# ExternalUrlNotEntered
source: Please enter external URL!
ru_ru: Пожалуйста, введите внешний URL!

# ExternalUrlNotValid
source: Please enter valid external URL!
ru_ru: Введенный внешний URL невалидный!

# ForDelayedPublication
source: Delayed Publication
ru_ru: Отложенная публикация

# ContentContainsAggregatedFields
source: You cannot create notification because there are aggregated fields in the content
ru_ru: Невозможно создать уведомление, потому что контент содержит агрегированные поля

# Template
source: Notification template
ru_ru: Шаблон уведомления

# TemplateIdNotEntered
source: Please select template
ru_ru: Выберите шаблон уведомления

source: Choose template
ru_ru: Выберите шаблон

# HideRecipients
source: Hide recipients from each other
ru_ru: Скрыть получателей друг от друга

source: Category
ru_ru: Категория

source: Choose Category
ru_ru: Выберите категорию

source: Confirmation template
ru_ru: Шаблон подтверждения
