Repository: QuantumArt/QP
Catalog: Resources/QpPluginStrings.*.resx
Languages: ru_ru

# AddNewPlugin
source: Add New QP Plugin
ru_ru: Добавить новый плагин QP

source: Service URL
ru_ru: URL сервиса

# ServiceUrlInvalidFormat
source: Invalid URL format
ru_ru: Введенный URL невалиден

# ServiceUrlMaxLengthExceeded
source: The length of URL should not exceed {1} characters
ru_ru: Длина URL не должна превышать {1} символов

# PluginNotFound
source: QP Plugin is not found (Id = {0})
ru_ru: Плагин QP не найден (Id = {0})

source: Contract
ru_ru: Контракт

source: Version
ru_ru: Версия

# Code
source: Service Code
ru_ru: Код сервиса

source: By Contract
ru_ru: По контракту

source: By Service Url
ru_ru: По Url сервиса

source: Plugin creation mode
ru_ru: Режим создания плагина

source: Order
ru_ru: Порядок

source: Instance Key
ru_ru: Ключ экземпляра

# ParsedContractInvalidMessage
source: Syntax error while parsing contract
ru_ru: Ошибка при синтаксическом разборе контракта

# CodeExists
source: Service Code + Instance Key already exists
ru_ru: Сочетание кода сервиса и ключа экземпляра уже используется

# VersionEqual
source: Contract version hasn't changed
ru_ru: Версия контракта не изменилась

# VersionNotEntered
source: Version is empty
ru_ru: Версия не задана

# CodeNotEntered
source: Service Code is empty
ru_ru: Код сервиса не задан

# FieldNameNotEntered
source: There are fields with empty names in contract
ru_ru: В контракте есть поля с пустыми именами

# FieldNameDuplicate
source: There are fields with equal names in contract
ru_ru: В контракте есть поля с одинаковыми именами

# FieldNameMaxLengthExceeded
source: There are fields names with length more than {1} characters in contract
ru_ru: В контракте есть поля c именем длиннее, чем {1} символов

# LoadedContractInvalidMessage
source: Error while loading contract from Service URL
ru_ru: Ошибка загрузки контракта по Url сервиса

# ContractNotEntered
source: Contract is empty
ru_ru: Контракт не задан

# VersionMaxLengthExceeded
source: The length of Version field should not exceed {1} characters
ru_ru: Длина поля Версия не должна превышать {1} символов

source: Reload contract
ru_ru: Перезагрузить контракт
