Repository: QuantumArt/QP
Catalog: Resources/SiteStrings.*.resx
Languages: ru_ru

# AllowUserSessions
source: Enable User Sessions
ru_ru: Включить пользовательские сессии

source: Always
ru_ru: Всегда

source: Assemble Preview and Notifications In Live Mode Only
ru_ru: Собирать страницы для предварительного просмотра и уведомлений в Основном режиме

source: Assembling Type
ru_ru: Тип сборки

# AssemblyPathInvalidFormat
source: Invalid assembly files physical path format
ru_ru: Физический путь для файлов сборок имеет некорректный формат

# AssemblyPathMaxLengthExceeded
source: The length of assembly files physical path should not exceed {5} characters
ru_ru: Длина физического пути для файлов сборок не должна превышать {5} символов

# AssemblyPathNotEntered
source: Please enter assembly files physical path
ru_ru: Пожалуйста, введите физический путь для файлов сборок

source: Connection string name
ru_ru: Имя строки подключения

source: Context class name
ru_ru: Имя контекстного класса

# DnsInvalidFormat
source: Invalid DNS format
ru_ru: DNS имеет некорректный формат

# DnsMaxLengthExceeded
source: The length of DNS should not exceed {5} characters
ru_ru: Длина DNS не должна превышать {5} символов

# DnsNotEntered
source: Please enter DNS
ru_ru: Пожалуйста, введите DNS!

# ForceAssemble
source: Force assembling without taking the date of the object last update into account
ru_ru: Принудительная сборка без учета даты последнего изменения объекта

source: Force Test Directory
ru_ru: Использовать тестовую папку

# ImportMappingToDb
source: Import mapping file to database
ru_ru: Импортировать файл отображения в базу данных

# Legend_AssemblingParameters
source: Assembling Parameters
ru_ru: Параметры сборки

# Legend_AssemblyFilesLocation
source: Assembly Files Location
ru_ru: Расположение файлов сборок

# Legend_LinqAssemblingParameters
source: LINQ Assembling Parameters
ru_ru: Параметры сборки в LINQ-классы

# Legend_LivePagesLocation
source: Live Pages Location
ru_ru: Расположение страниц в Основном режиме

# Legend_OnScreenAssemblingParameters
source: OnScreen Assembling Parameters
ru_ru: Параметры сборки OnScreen

# Legend_Parameters
source: Basic parameters
ru_ru: Основные параметры

# Legend_SiteLocation
source: Site Location
ru_ru: Адрес сайта

# Legend_SiteMode
source: Site Mode
ru_ru: Режим работы сайта

# Legend_StagePagesLocation
source: Stage Pages Location
ru_ru: Расположение страниц в Тестовом режиме

# Legend_UploadedFilesLocation
source: Uploaded Files Location
ru_ru: Расположение загруженных файлов

source: Live
ru_ru: Основной

# LiveAssemblyPath
source: Live Physical Path
ru_ru: Физический путь для Основного режима

# LiveDirectory
source: Physical Path
ru_ru: Физический путь

# LiveDirectoryInvalidFormat
source: Invalid physical path for Live Mode format
ru_ru: Физический путь для страниц сайта в Основном режиме имеет некорректный формат

# LiveDirectoryMaxLengthExceeded
source: The length of site pages physical path for Live Mode should not exceed {5} characters
ru_ru: Длина физического пути для страниц сайта в Основном режиме не должна превышать {5} символов

# LiveDirectoryNotEntered
source: Please enter site pages physical path for Live Mode
ru_ru: Пожалуйста, введите физический путь для страниц сайта в Основном режиме

# LiveVirtualRoot
source: Virtual Path
ru_ru: Виртуальный путь

# LiveVirtualRootInvalidFormat
source: Invalid site pages virtual path for Live Mode format
ru_ru: Виртуальный путь для страниц сайта в Основном режиме имеет некорректный формат

# LiveVirtualRootMaxLengthExceeded
source: The length of site pages virtual path for Live Mode should not exceed {5} characters
ru_ru: Длина виртуального пути для страниц сайта в Основном режиме не должна превышать {5} символов

# LiveVirtualRootNotEntered
source: Please enter site pages virtual path for Live Mode
ru_ru: Пожалуйста, введите виртуальный путь для станиц сайта в Основном режиме!

# Name
source: Site Name
ru_ru: Имя сайта

# NameInvalidFormat
source: Invalid site name
ru_ru: Некорректное имя сайта

# NameMaxLengthExceeded
source: The length of site name should not exceed {5} characters
ru_ru: Длина имени сайта не должна превышать {5} символов

# NameNonUnique
source: Site name is already in using
ru_ru: Такое имя сайта уже используется

# NameNotEntered
source: Please enter site name
ru_ru: Пожалуйста, введите имя сайта

# Namespace
source: Namespace for generated classes
ru_ru: Пространство имен для генерируемых классов

source: Never
ru_ru: Никогда

source: No
ru_ru: Нет

source: On Mouse Over
ru_ru: При наведении курсором

# OnScreenFieldBorder
source: Field Border
ru_ru: Рамка поля

# OnScreenObjectBorder
source: Object Border
ru_ru: Рамка объекта

# ProceedMappingWithDb
source: Use direct mapping from database
ru_ru: Использовать прямое отображение из базы данных

source: Replace URLs
ru_ru: Заменять URL'ы

source: Site Mode
ru_ru: Режим работы сайта

source: Stage
ru_ru: Тестовый

# StageAssemblyPath
source: Stage Physical Path
ru_ru: Физический путь для Тестового режима

# StageAssemblyPathInvalidFormat
source: Invalid assembly files physical path for Stage Mode format
ru_ru: Физический путь для файлов сборок в Тестовом режиме имеет некорректный формат

# StageAssemblyPathMaxLengthExceeded
source: The length of assembly files physical path for Stage Mode should not exceed {5} characters
ru_ru: Длина физического пути для файлов сборок в Тестовом режиме не должна превышать {5} символов

# StageAssemblyPathNotEntered
source: Please enter assembly files physical path for Stage Mode
ru_ru: Пожалуйста, введите физический путь для файлов сборок в Тестовом режиме

# StageDirectory
source: Physical Path
ru_ru: Физический путь

# StageDirectoryInvalidFormat
source: Invalid physical path for Stage Mode format
ru_ru: Физический путь для страниц сайта в Тестовом режиме имеет некорректный формат

# StageDirectoryMaxLengthExceeded
source: The length of site pages physical path for Stage Mode should not exceed {5} characters
ru_ru: Длина физического пути для страниц сайта в Тестовом режиме не должна превышать {5} символов

# StageDirectoryNotEntered
source: Please enter site pages physical path for Stage Mode
ru_ru: Пожалуйста, введите физический путь для страниц сайта в Тестовом режиме

source: Stage DNS
ru_ru: DNS для тестового режима

# StageDnsInvalidFormat
source: Invalid DNS for Stage Mode format
ru_ru: DNS для тестового режима имеет некорректный формат

# StageDnsMaxLengthExceeded
source: The length of DNS for Stage Mode should not exceed {5} characters
ru_ru: Длина DNS для Тестового режима не должна превышать {5} символов

# StageDnsNotEntered
source: Please enter DNS for Stage Mode
ru_ru: Пожалуйста, введите DNS для Тестового режима

# StageVirtualRoot
source: Virtual Path
ru_ru: Виртуальный путь

# StageVirtualRootInvalidFormat
source: Invalid site pages virtual path for Stage Mode format
ru_ru: Виртуальный путь для страниц сайта в Тестовом режиме имеет некорректный формат

# StageVirtualRootMaxLengthExceeded
source: The length of site pages virtual path for Stage Mode should not exceed {5} characters
ru_ru: Длина виртуального пути для страниц сайта в Тестовом режиме не должна превышать {5} символов

# StageVirtualRootNotEntered
source: Please enter site pages virtual path for Stage Mode
ru_ru: Пожалуйста, введите виртуальный путь для страниц сайта в Тестовом режиме

source: Test Directory
ru_ru: Тестовая папка

# TestDirectoryInvalidFormat
source: Invalid test directory path format
ru_ru: Физический путь к тестовой папке имеет некорректный формат

# TestDirectoryMaxLengthExceeded
source: The length of test directory path should not exceed {5} characters
ru_ru: Длина физического пути к тестовой папке не должна превышать {5} символов

# UploadDirInvalidFormat
source: Invalid physical path for file uploading format
ru_ru: Физический путь для загрузки файлов имеет некорректный формат

# UploadDirMaxLengthExceeded
source: The length of physical path for file uploading should not exceed {5} characters
ru_ru: Длина физического пути для загрузки файлов не должна превышать {5} символов

# UploadDirNotEntered
source: Please enter physical path for file uploading
ru_ru: Пожалуйста, введите физический путь для загрузки файлов

# UploadPath
source: Physical Path
ru_ru: Физический путь

# UploadUrl
source: Virtual Path
ru_ru: Виртуальный путь

# UploadUrlInvalidFormat
source: Invalid virtual path for file uploading format
ru_ru: Виртуальный путь для загрузки файлов имеет некорректный формат

# UploadUrlMaxLengthExceeded
source: The length of virtual path for file uploading should not exceed {5} characters
ru_ru: Длина виртуального пути для загрузки файлов не должна превышать {5} символов

# UploadUrlNotEntered
source: Please enter virtual path for file uploading
ru_ru: Пожалуйста, введите виртуальный путь для загрузки файлов

# UploadUrlPrefix
source: Virtual Path Prefix
ru_ru: Префикс виртуального пути

# UploadUrlPrefixInvalidFormat
source: Invalid virtual path prefix for file uploading format
ru_ru: Префикс виртуального пути для загрузки файлов имеет некорректный формат

# UploadUrlPrefixMaxLengthExceeded
source: The length of virtual path prefix for file uploading should not exceed {5} characters
ru_ru: Длина префикса виртуального пути для загрузки файлов не должна превышать {5} символов

# UseAbsoluteUploadUrl
source: Use absolute virtual path
ru_ru: Использовать абсолютный виртуальный путь

source: Use long URLs
ru_ru: Использовать длинные URL'ы

source: Use Separate DNS for Stage Mode
ru_ru: Использовать отдельный DNS для Тестового режима

source: Yes
ru_ru: Да

# Tooltip_LockedByUser
source: Locked by user {0}
ru_ru: Заблокирован пользователем {0}

# Tooltip_LockedByYou
source: Locked by you
ru_ru: Заблокирован Вами

# Link_AddNewSite
source: Add new site
ru_ru: Добавить новый сайт

# Header_AddNewSite
source: Add new site
ru_ru: Добавление нового сайта

# Header_EditSite
source: Edit site "{0}"
ru_ru: Редактирование сайта "{0}"

# Header_SiteList
source: Site list
ru_ru: Список сайтов

# LockedByAnyoneElse
source: Site is locked by user {0}.
ru_ru: Сайт заблокирован пользователем {0}.

# CannotUpdateBecauseOfSecurity
source: Cannot update site because you have no enough permissions
ru_ru: Невозможно обновить сайт, потому что у Вас недостаточно прав доступа

# SomeoneBlockedByWorkflow
source: Some sites have not been processed because you are not a workflow member. Id: {0}
ru_ru: Некоторые сайты не обработаны, потому что вы не являетесь участником workflow. Id: {0}

# SomeoneLocked
source: Some sites have not been processed because they are locked by other users. Id: {0}
ru_ru: Некоторые сайты не обработаны, потому что они заблокированы другими пользователями. Id: {0}

# SomeoneNotAccessed
source: Some sites have not been processed because of insufficient permissions. Id: {0}
ru_ru: Некоторые сайты не обработаны из-за недостаточных прав доступа. Id: {0}

# SomeoneNotFound
source: Some sites have not been found. Id: {0}
ru_ru: Некоторые сайты не найдены. Id: {0}

# ConnectionStringNameInvalidFormat
source: Wrong connection string name
ru_ru: Некорректное имя строки подключения

# ConnectionStringNameMaxLengthExceeded
source: The length of connection string name should not exceed {5} characters
ru_ru: Длина имени строки подключения не должна превышать {5} символов

# ContextClassNameInvalidFormat
source: Wrong context class name
ru_ru: Некорректное имя контекстного класса

# ContextClassNameMaxLengthExceeded
source: The length of context class name should not exceed {5} characters
ru_ru: Длина имени контекстного класса не должна превышать {5} символов

# DbIndependent
source: Proceed DB-independent generation
ru_ru: Выполнять генерацию, независимую от БД

source: Enable OnScreen
ru_ru: Разрешить OnScreen

# Legend_VisualEditor
source: Visual Editor Parameters
ru_ru: Параметры визуального редактора

# MapFileOnly
source: Generate only .map file
ru_ru: Генерировать только .map-файл

# NamespaceInvalidFormat
source: Wrong namespace
ru_ru: Некорректное пространство имен

# NamespaceMaxLengthExceeded
source: The length of namespace should not exceed {5} characters
ru_ru: Длина имени пространства имен не должна превышать {5} символов

# PEnterMode
source: Insert P tag while pressing Enter
ru_ru: Вставлять тег P при нажатии Enter

# TestDirectoryNotEntered
source: Please enter test directory
ru_ru: Пожалуйста, введите тестовую папку

# UploadUrlPrefixNotEntered
source: Please enter upload url prefix
ru_ru: Пожалуйста, введите префикс виртуального пути для загрузки файлов

source: Description
ru_ru: Описание

# DescriptionMaxLengthExceeded
source: The length of description should not exceed {5} characters
ru_ru: Длина описания не должна превышать {5} символов

# ContextClassNameNonUnique
source: Context class name (with namespace) is already in using on the site
ru_ru: Имя контекстного класса (с учетом пространства имен) не является уникальным на уровне сайта

# SiteNotFound
source: Site not found (Id = {0})
ru_ru: Сайт не найден (Id = {0})

# ShouldBeDotNet
source: Site assembling type should be set into the 'ASP.NET' value to execute this action
ru_ru: Для выполнения этого действия тип сборки сайта должен быть установлен в значение 'ASP.NET'

# SiteInLiveWarning
source: Warning! Site is now in live mode. Site properties was modified by {1} at {0}. Do you really want to proceed assembling?
ru_ru: Внимание! Сайт сейчас находится в Основном режиме. Свойства сайта были модифицированы пользователем {1} в {0}. Вы действительно хотите выполнить сборку?

# UseEnglishQuotes
source: Use english typografic rules
ru_ru: Использовать правила английской типографики

# RemoveSiteStageName
source: Removing Site "{0}"
ru_ru: Удаление сайта "{0}"

# RemoveSiteArticlesStageName
source: Removing articles from site "{0}"
ru_ru: Удаление статей сайта "{0}"

# RemoveSiteContentsStageName
source: Removing contents from site "{0}"
ru_ru: Удаление контентов сайта "{0}"

# CreateSiteFoldersStageName
source: Creating folders for site "{0}"
ru_ru: Создания папок для сайта "{0}"

# AssembleLiveSiteConfirmation
source: Are you sure to assemble Live Site?
ru_ru: Вы уверены что хотите собрать основной сайт?

# AssembleTemplatesStageName
source: Assembling Templates for Site "{0}"
ru_ru: Сборка шаблонов для сайта "{0}"

# AssemblePagesStageName
source: Assembling Pages for Site "{0}"
ru_ru: Сборка страниц для сайта "{0}"

# AssembleNotificationStageName
source: Assembling Notifications for Site "{0}"
ru_ru: Сборка уведомлений для сайта "{0}"

source: External URL
ru_ru: Внешний URL

# Legend_NotificationProperties
source: Notification Properties
ru_ru: Свойства уведомлений

# ExternalUrlNotValid
source: Please enter valid external URL
ru_ru: Пожалуйста, введите валидный внешний URL

source: Send notifications
ru_ru: Посылать уведомления

# Legend_CustomValidation
source: Custom Validation
ru_ru: Пользовательская валидация

# XamlDictionaries
source: Dictionaries for XAML Validation
ru_ru: Словари для валидации XAML

source: Create Default XAML Dictionary
ru_ru: Создать словарь для валидации XAML по умолчанию

source: Create like site
ru_ru: Создать по образцу

# CopySiteContents
source: Copying contents from site "{0}"
ru_ru: Копирование контентов сайта "{0}"

# CopySiteArticles
source: Copying articles from site "{0}"
ru_ru: Копирование статей сайта "{0}"

# CopySiteVirtualContents
source: Copying virtual contents from site "{0}"
ru_ru: Копирование виртуальных контентов сайта "{0}"

# CopySiteSettings
source: Copying settings of site {0}
ru_ru: Копирование настроек сайта {0}

# CopySiteUpdateArticleIds
source: Updating links between articles
ru_ru: Обновление ссылок между статьями

# Legend_CopySiteSettings
source: Copy site settings
ru_ru: Настройки копирования сайта

# DoNotCopyArticles
source: Do not copy contents with more then specified amount of articles
ru_ru: Не копировать контенты, которые содержат более указанного количества статей

source: Do not copy files
ru_ru: Не копировать файлы

source: Do not copy templates
ru_ru: Не копировать шаблоны

# CopySiteContentLinks
source: Copying content links from site "{0}"
ru_ru: Копирование связей между контентами сайта "{0}"

source: Content form script
ru_ru: Скрипт для формы контента

# Legend_Scripts
source: Scripts
ru_ru: Скрипты

# AssemblePagesError
source: Pages are not assembled:
ru_ru: Страницы не собраны:

# AssemblePagesResult
source: Missed {0} pages:
ru_ru: Пропущено страниц: {0} :

# QP7MissingPassword
source: Password is missing for QP7 authentication. Need relogin.
ru_ru: Для QP7 нужна повторная авторизация.

# SettingQP7PathIsMissed
source: Setting "QP7Path" is not defined
ru_ru: Настройка "QP7Path" не задана

# DownloadEfSource
source: Download EF data source only
ru_ru: Скачивать только источник данных для EF

source: External Development
ru_ru: Внешняя разработка

# DisableListAutoWrap
source: Disable list auto wrapping (ul, ol, dl)
ru_ru: Отключить автоматическое оборачивание списков (ul, ol, dl)

# CopySiteItemLinks
source: Copying links between articles
ru_ru: Копирование ссылок между статьями
