Repository: QuantumArt/QP
Catalog: Resources/StatusTypeStrings.*.resx
Languages: ru_ru

# AddNewStatusType
source: Add New Status
ru_ru: Добавить новый статус

# AltColor
source: Alternate color
ru_ru: Альтернативный цвет

# AltColorInvalidFormat
source: Invalid Alternate color format
ru_ru: Поле Альтернативный цвет имеет некорректный формат

# AltColorLengthExceeded
source: The length of Alternate color should not exceed {1} characters
ru_ru: Длина поля Альтернативный цвет не должна превышать {1} символов

# AltColorMissed
source: You should specify Alternate color or clear Color
ru_ru: Вы должны задать поле Альтернативный цвет или очистить поле Цвет

source: Color
ru_ru: Цвет

# ColorInvalidFormat
source: Invalid Color format
ru_ru: Поле Цвет имеет некорректный формат

# ColorLengthExceeded
source: The length of Color should not exceed {1} characters
ru_ru: Длина поля Цвет не должна превышать {1} символов

# ColorMissed
source: You should specify Color or clear Alternate color
ru_ru: Вы должны задать поле Цвет или очистить поле Альтернативный цвет

# StatusArticleUsage
source: This status is used by an article and can not be deleted
ru_ru: Этот статус используется в статье и не может быть удален

# StatusBuiltIn
source: This status is Built-In and can not be deleted
ru_ru: Этот статус является встроенным и не может быть удален

# StatusTypeNotFound
source: Status is not found (Id={0})
ru_ru: Статус не найден (Id={0})

# StatusWorkflowUsage
source: This status is used by workflow and can not be deleted
ru_ru: Этот статус используется в workflow и не может быть удален

source: Weight
ru_ru: Вес

# WeightIsInUse
source: This site already has a status with such weight
ru_ru: Статус с таким весом уже существует в текущем сайте

# Alias
source: User Name
ru_ru: Пользовательское имя

# DemotedMessage
source: The article status was demoted from [{0}] to [{1}]. Comment: {2}
ru_ru: Статус статьи был понижен с [{0}] до [{1}]. Комментарий: {2}

# PromotedMessage
source: The article status was promoted from [{0}] to [{1}]. Comment: {2}
ru_ru: Статус статьи был повышен с [{0}] до [{1}]. Комментарий: {2}
