Repository: QuantumArt/QP
Catalog: Resources/UserStrings.*.resx
Languages: ru_ru

source: Active
ru_ru: Активный

source: Add new User
ru_ru: Добавить нового пользователя

# AllowStageEditField
source: Allow for fields
ru_ru: Разрешить для полей

# AllowStageEditObject
source: Allow for objects
ru_ru: Разрешить для объектов

# ArticlesInsertAll
source: Insert all articles
ru_ru: Вставить все статьи

# ArticlesInsertAndUpdate
source: Update existing and add new articles
ru_ru: Вставить новые и обновить существующие статьи

# ArticlesInsertNew
source: Insert only new articles
ru_ru: Вставить только новые статьи

# ArticlesUpdate
source: Update articles
ru_ru: Обновить статьи

# ArticlesUpdateIfChanged
source: Update articles specified in column IsChanged
ru_ru: Обновить статьи, указанные в колонке IsChanged

# AutoLogOn
source: Auto Login
ru_ru: Автоматический вход

# CannotRemoveBuitInUser
source: You cannot remove built-in user.
ru_ru: Вы не можете удалить встроенного пользователя.

# ContentDefaultFiltersTitle
source: Default Filters
ru_ru: Фильтрация по умолчанию

# DefaultFilterArticles
source: Articles
ru_ru: Статьи

# DefaultFilterContent
source: Content
ru_ru: Контент

# DefaultFilterSite
source: Site
ru_ru: Сайт

source: Disabled
ru_ru: Заблокирован

# EmailInvalidFormat
source: Invalid e-mail!
ru_ru: Некорректный e-mail!

# EmailMaxLengthExceeded
source: The length of e-mail should not exceed {5} characters!
ru_ru: Длина e-mail не может превышать {5} симоволов!

# EmailNotEntered
source: Please enter e-mail!
ru_ru: Пожалуйста, введите e-mail!

# EnableContentGroupingInTree
source: Enable сontent grouping in backend tree
ru_ru: Разрешить группировку контентов в дереве бэкенда

source: English
ru_ru: Английский

source: First Name
ru_ru: Имя

# FirstNameMaxLengthExceeded
source: The length of first name should not exceed {5} characters!
ru_ru: Длина имени не может превышать {5} символов!

# FirstNameNotEntered
source: Please enter first name!
ru_ru: Пожалуйста, введите имя!

source: Language
ru_ru: Язык

# LastLogOn
source: Last Visit
ru_ru: Последнее посещение

source: Last Name
ru_ru: Фамилия

# LastNameMaxLengthExceeded
source: The length of last name should not exceed {5} characters!
ru_ru: Длина фамилии не может превышать {5} символов!

# LastNameNotEntered
source: Please enter last name!
ru_ru: Пожалуйста, введите фамилию!

source: Login
ru_ru: Логин

# LoginData
source: Login Parameters
ru_ru: Параметры входа

# LoginInvalidFormat
source: Invalid login!
ru_ru: Некорректный логин!

# LoginLengthExceeded
source: The length of login should not exceed {5} characters!
ru_ru: Длина логина не может превышать {5} символов!

# LoginNotEntered
source: Please inter Login!
ru_ru: Пожалуйста, введите логин

# LoginNotUnique
source: Login is already in using!
ru_ru: Такой логин уже используется!

# MembershipData
source: Membership
ru_ru: Членство

# MustChangePassword
source: User must change password at next logon
ru_ru: Пользователь должен сменить пароль при следующем входе

source: New password
ru_ru: Новый пароль

source: New password and copy doesn't match!
ru_ru: Новый пароль не совпадает с копией!

source: New password copy
ru_ru: Копия нового пароля

# NewPasswordCopyNotEntered
source: Please enter copy new password!
ru_ru: Пожалуйста, введите копию нового пароля!

# NewPasswordIncorrect
source: Incorrect new pasword!
ru_ru: Некорректный новый пароль!

# NewPasswordMatchCurrentPassword
source: New password cannot match current password
ru_ru: Новый пароль не должен совпадать с текущим паролем

# NewPasswordNotEntered
source: Please enter new password!
ru_ru: Пожалуйста, введите новый пароль!

# NotificationsExist
source: You cannot remove user because there are notifications received by user. Notifications: {0}
ru_ru: Вы не можете удалить пользователя, так как существуют уведомления которые получает пользователь. Уведомления: {0}

source: NT-login
ru_ru: NT-логин

# NtLoginInvalidFormat
source: Invalid NT-login
ru_ru: Некорректный NT-логин

# NtLoginLengthExceeded
source: The length of NT-login should not exceed {5} characters!
ru_ru: Длина NT-логина не может превышать {5} символов!

# NtLoginNotEntered
source: Please inter NT-login!
ru_ru: Пожалуйста, введите NT-логин

# OnScreenData
source: OnScreen Parameters
ru_ru: Параметры OnScreen

source: Password
ru_ru: Пароль

# PasswordContainsLogin
source: Login and password cannot match or contain each other
ru_ru: Логин и пароль не могут совпадать или быть составной частью друг друга

# PasswordLengthExceeded
source: The length of password have to be between {0} and {1}!
ru_ru: Длина пароля должна быть от {0} до {1} символов!

# PasswordMinLength
source: Minimum password length is 7 chars
ru_ru: Минимальная длина пароля - 7 символов

# PasswordNotComplex
source: Password must contain characters from from three of the four categories: digits, latin uppercase letters, latin lowercase letters, non-alfanumeric characters
ru_ru: Пароль должен содержать символы как минимум из трех нижеперечисленных категорий: цифры, латинские прописные буквы, латинские строчные буквы, символы верхнего регистра

# PasswordNotEntered
source: Please enter password!
ru_ru: Пожалуйста, введите пароль!

source: Profile data
ru_ru: Данные профиля

source: Russian
ru_ru: Русский

# SelectedGroupIDs
source: Groups
ru_ru: Группы

# UnbindBuitInGroup
source: You cannot unbind built-in user from built-in groups: {0}
ru_ru: Вы не можете удалить встроенного пользователя из встроенных групп: {0}

# UserCouldntBindToWFAndAdminDescGroups
source: User could not bind to the groups used parallel workflow and to the Administrators group or it descendants at the same time.
ru_ru: Пользователь не может одновременно быть добавлен в группы, использующие параллельный Workflow, и в группу "Администраторы" или ее наследников.

# UserHasNotBeenCreated
source: New user has not been created.
ru_ru: Новый пользователь не был создан.

# UserNotFound
source: User is not found (Id={0})
ru_ru: Пользователь не найден (Id={0})

source: View settings
ru_ru: Настройки отображения

# WorkflowsExist
source: You cannot remove user because there are workflows which involve user. Workflows: {0}
ru_ru: Вы не можете удалить пользователя, так как существуют процессы в которые участвует пользователь. Процессы: {0}
