Repository: QuantumArt/QP
Catalog: Resources/VisualEditorStrings.*.resx
Languages: ru_ru

source: Add New External CSS
ru_ru: Добавить новый внешний CSS

# AddNewVisualEditorCommand
source: Add New Visual Editor Plugin Command
ru_ru: Добавить новую команду визуального редактора

source: Add New Visual Editor Plugin
ru_ru: Добавить новый плагин визуального редактора

source: Add New Visual Editor Style
ru_ru: Добавить новый стиль визуального редактора

# Attributes
source: HTML Attributes
ru_ru: HTML - атрибуты

# CommandAliasDuplicate
source: Command`s #{0} alias should be unique within its VE Plugin`s сommands
ru_ru: Алиас команды №{0} должен быть уникален в пределах плагина

# CommandAliasMaxLengthExceeded
source: The length of command`s #{0} Alias should not exceed 255 characters!
ru_ru: Длина алиаса команды №{0} не должна превышать 255 символов

# CommandAliasNonUnique
source: Command`s #{0} Alias should be unique within all VE сommands!
ru_ru: Алиас команды №{0} должен быть уникальным между плагинами

# CommandAliasRequired
source: Please enter alias for command #{0}!
ru_ru: Пожалуйста, введите алиас для команды №{0}

# CommandNameDuplicate
source: Command`s #{0} name should be unique within its VE Plugin`s сommands!
ru_ru: Имя команды №{0} должно быть уникальным в пределах плагина

# CommandNameInvalidFormat
source: Command #{0} has invalid name format!
ru_ru: У команды №{0} некорректное имя

# CommandNameMaxLengthExceeded
source: The Length of command`s #{0} name should not exceed 255 сharacters!
ru_ru: Длина имени команды №{0} не должна превышать 255 символов

# CommandNameNonUnique
source: Command`s #{0} name should be unique within all VE сommands
ru_ru: Имя команды №{0} должно быть уникальным между плагинами

# CommandNameRequired
source: Please enter name for command #{0}!
ru_ru: Пожалуйста, введите имя для команды №{0}

# CommandNotValid
source: Some commands are not valid
ru_ru: Некоторые команды невалидны

source: Commands
ru_ru: Команды

# CommandsRequired
source: At least one visual editor command is required!
ru_ru: Должна быть указана хотя бы одна команда визуального редактора

source: External CSS
ru_ru: Внешние CSS

# ExternalCssUrlDuplicate
source: External CSS`s #{0} URL is duplicate
ru_ru: У внешнего CSS №{0} дублирующий URL

# ExternalCssUrlMaxLengthExceeded
source: External CSS`s #{0} URL should not exceed 255 characters!
ru_ru: Длина URL внешнего CSS №{0} не должна превышать 255 символов

# ExternalCssUrlNotValid
source: External CSS`s #{0} URL is not valid
ru_ru: У внешнего CSS №{0} невалидный URL

# ExternalCssUrlRequired
source: Please enter URL for External CSS #{0}!
ru_ru: Пожалуйста, введите URL для внешнего CSS №{0}

# HeaderAlias
source: Alias
ru_ru: Алиас

# HeaderName
source: Name
ru_ru: Имя

# IsFormat
source: Format
ru_ru: Формат

# IsSystem
source: System
ru_ru: Системный

source: Order
ru_ru: Порядок

source: Overrides Tag
ru_ru: Заменяет тег

source: Root Element Class
ru_ru: Класс корневого элемента

source: Styles
ru_ru: Стили

source: Style Settings
ru_ru: Настройки стиля

source: Tag
ru_ru: Тег

# UrlPrefixInvalidFormat
source: Invalid URL format
ru_ru: Введенный URL невалиден

# UrlPrefixMaxLengthExceeded
source: The length of URL should not exceed {1} characters
ru_ru: Длина URL не должна превышать {5} символов

# VisualEditorPluginNotFound
source: Visual Editor Plugin is not found (Id = {0})
ru_ru: Плагин визуального редактора не найден (Id = {0})

# VisualEditorStyleNotFound
source: Visual Editor Style is not found (Id = {0})
ru_ru: Стиль визуального редактора не найден (Id = {0})

source: Add New CSS Style
ru_ru: Добавить новый CSS-стиль

source: Add New HTML Attribute
ru_ru: Добавить новый HTML-атрибут

# HeaderValue
source: Value
ru_ru: Значение

# Attribute
source: HTML Attribute
ru_ru: HTML - атрибута

# AttributesMessage
source: HTML Attributes
ru_ru: HTML - атрибутов

source: Style
ru_ru: Стиля

# StylesMessage
source: Styles
ru_ru: Стилей

# VeStyleAggrListItemNameDuplicate
source: {0}`s #{1} Name should be unique within its VE Style`s {2}
ru_ru: Имя {0} №{1} должно быть уникально в пределах {2} Стиля Визуального редактора

# VeStyleAggrListItemNameInvalidFormat
source: {0}`s #{1} Name has invalid format
ru_ru: У {0} №{1} невалидное имя

# VeStyleAggrListItemNameMaxLengthExceeded
source: The length of {0}`s #{1} Name length should not exceed 255 characters
ru_ru: Длина имени {0} №{1} не должно превышать 255 символов

# VeStyleAggrListItemNameRequired
source: Please enter {0}`s #{1} Name!
ru_ru: Пожалуйста, введите имя {0} №{1}!

# VeStyleAggrListItemValueMaxLengthExceeded
source: The length of {0}`s #{1} Value length should not exceed 255 characters
ru_ru: Длина значения {0} №{1} не должно превышать 255 символов

# VeStyleAggrListItemValueRequired
source: Please enter {0}`s #{1} Value!
ru_ru: Пожалуйста, введите значение {0} №{1}!

# SystemWarning
source: Visual editor style (Id = {0}) can`t be removed because it is a system VE style
ru_ru: Стиль визуального редактора (Id = {0}) не может быть удален, т.к. он является системным

source: Formats
ru_ru: Форматы
