window.Backend.Lang.EntityEditor = {
  refreshConfirmMessage: 'В поля формы внесены изменения.\nВы действительно хотите обновить документ?',
  changeConfirmMessage: 'В поля формы внесены изменения.\nВы действительно хотите сменить документ?',
  closeConfirmMessage: 'В поля формы внесены изменения.\nВы действительно хотите закрыть документ?',
  fieldsNotChangedMessage: 'Ни в одном из полей формы нет изменений!',
  entitySuccessfullyAddedMessage: '{0} "{1}" успешно создан(а)!',
  entitySuccessfullyUpdatedMessage: '{0} "{1}" успешно обновлен(a)!',
  versionSuccessfullyRestoredMessage: 'Версия "{0}" успешно восстановлена!',
  autoRefreshConfirmMessage: 'У Вас открыта форма для редактирования данных, которые уже стали неактуальны.\nВы хотите обновить данную форму с потерей всех внесенных изменений?',
  autoRefreshConfirmMessageAfterArticleRestoring: 'У Вас открыта форма для редактирования статьи (id = {0}), информация о которой стала неактуальной после восстановления версии.\nВы хотите обновить данную форму с потерей всех внесенных изменений?',
  variationExists: 'Для выбранного контекста существует вариация (ID: {0})',
  newVariationExists: 'Для выбранного контекста существует новая (несохраненная) вариация, которая будет сохранена вместе с базовой статьей',
  variationNotExists: 'Для выбранного контекста не cуществует вариации, но при изменении любого из полей она будет создана.',
  baseArticle: 'Не выбран ни один из контекстов, поэтому показывается базовая статья',
  selectField: 'Выберите поле',
  fieldDescriptionWndCaption: 'Описание поля'
};
